{
  "abilityScores": [
    {
      "name": "str",
      "value": 23
    },
    {
      "name": "dex",
      "value": 12
    },
    {
      "name": "con",
      "value": 21
    },
    {
      "name": "int",
      "value": 18
    },
    {
      "name": "wis",
      "value": 15
    },
    {
      "name": "cha",
      "value": 17
    }
  ],
  "actions": [
    {
      "description": "Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage.",
      "name": "Bite",
      "sortOrder": 0,
      "steps": [
        {
          "attack": {
            "ability": "str",
            "crit": 20,
            "damageRolls": [
              {
                "abilityName": "str",
                "dice": "2d10",
                "type": "Piercing"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Bite",
            "rollsAttack": true
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage.",
      "name": "Claw",
      "sortOrder": 1,
      "steps": [
        {
          "attack": {
            "ability": "str",
            "crit": 20,
            "damageRolls": [
              {
                "abilityName": "str",
                "dice": "2d6",
                "type": "Slashing"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Claw",
            "rollsAttack": true
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "Melee Weapon Attack: +11 to hit, reach 15 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage.",
      "name": "Tail",
      "sortOrder": 2,
      "steps": [
        {
          "attack": {
            "ability": "str",
            "crit": 20,
            "damageRolls": [
              {
                "abilityName": "str",
                "dice": "2d6",
                "type": "Bludgeoning"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Tail",
            "rollsAttack": true
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 16 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.",
      "name": "Frightful Presence",
      "sortOrder": 3,
      "steps": [
        {
          "attack": {
            "crit": 20,
            "isProficient": true,
            "isRanged": false,
            "name": "Frightful Presence",
            "rollsAttack": false,
            "savingThrow": {
              "abilityName": "wis",
              "difficultyClass": 16
            }
          },
          "journalCommand": {
          },
          "skillCheck": {
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "The dragon exhales acid in a 60-foot line that is 5 feet wide. Each creature in that line must make a DC 18 Dexterity saving throw, taking 54 (12d8) acid damage on a failed save, or half as much damage on a successful one.",
      "name": "Acid Breath",
      "sortOrder": 4,
      "steps": [
        {
          "attack": {
            "crit": 20,
            "damageRolls": [
              {
                "dice": "12d8",
                "type": "Acid"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Acid Breath",
            "rollsAttack": false,
            "savingThrow": {
              "abilityName": "dex",
              "difficultyClass": 18
            }
          },
          "journalCommand": {
          },
          "skillCheck": {
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "The dragon exhales gas in a 60-foot cone. Each creature in that area must succeed on a DC 18 Constitution saving throw. On a failed save, the creature can't use reactions, its speed is halved, and it can't make more than one attack on its turn. In addition, the creature can use either an action or a bonus action on its turn, but not both. These effects last for 1 minute. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself with a successful save.",
      "name": "Slowing Breath",
      "sortOrder": 5,
      "steps": [
        {
          "attack": {
            "crit": 20,
            "isProficient": true,
            "isRanged": false,
            "name": "Slowing Breath",
            "rollsAttack": false,
            "savingThrow": {
              "abilityName": "con",
              "difficultyClass": 18
            }
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 19 Dexterity saving throw or take 13 (2d6 + 6) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed.",
      "name": "Wing Attack (Costs 2 Actions)",
      "sortOrder": 6,
      "steps": [
        {
          "attack": {
            "crit": 20,
            "damageRolls": [
              {
                "abilityName": "str",
                "dice": "2d6",
                "type": "Bludgeoning"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Wing Attack (Costs 2 Actions)",
            "rollsAttack": false,
            "savingThrow": {
              "abilityName": "dex",
              "difficultyClass": 19
            }
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "The dragon chooses a point on the ground that it can see within 120 feet of it. A cloud of pink gas fills a 20-foot-radius sphere centered on that point. Each creature in that area that fails a DC 15 Wisdom saving throw is incapacitated with laughter until the end of its next turn.",
      "name": "Laughing Gas",
      "sortOrder": 7,
      "steps": [
        {
          "attack": {
            "crit": 20,
            "isProficient": true,
            "isRanged": false,
            "name": "Laughing Gas",
            "rollsAttack": true,
            "savingThrow": {
              "abilityName": "wis",
              "difficultyClass": 15
            }
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "The dragon chooses a creature it can see within 120 feet of it. If the target fails a DC 15 Constitution saving throw, its speed is halved, and it can't use reactions or bonus actions until the end of its next turn.",
      "name": "Torpid Energy",
      "sortOrder": 8,
      "steps": [
        {
          "attack": {
            "crit": 20,
            "isProficient": true,
            "isRanged": false,
            "name": "Torpid Energy",
            "rollsAttack": false,
            "savingThrow": {
              "abilityName": "con",
              "difficultyClass": 15
            }
          },
          "type": "custom-attack"
        }
      ]
    }
  ],
  "alignment": "Chaotic Good",
  "armorClass": 18,
  "armorType": "Natural Armor",
  "challengeRating": "14",
  "classes": [
    {
      "class": "Monster",
      "level": 1
    }
  ],
  "currentHp": 184,
  "damageImmunities": [
    {
      "damageType": "Acid"
    }
  ],
  "exp": 11500,
  "hitDice": "16d12+80",
  "imageUri": "https://cdn.alchemyrpg.com/app-assets/dragon-token.svg",
  "initiativeBonus": 0,
  "isNPC": true,
  "maxHp": 184,
  "movementModes": [
    {
      "distance": 40,
      "mode": "Walking"
    },
    {
      "distance": 40,
      "mode": "Climb"
    },
    {
      "distance": 80,
      "mode": "Fly"
    }
  ],
  "name": "Adult Copper Dragon",
  "proficiencies": [
    {
      "name": "Dexterity",
      "type": "save"
    },
    {
      "name": "Constitution",
      "type": "save"
    },
    {
      "name": "Wisdom",
      "type": "save"
    },
    {
      "name": "Charisma",
      "type": "save"
    },
    {
      "name": "Common",
      "type": "language"
    },
    {
      "name": "Draconic",
      "type": "language"
    }
  ],
  "proficiencyBonus": 5,
  "race": "NPC",
  "senses": [
    {
      "distance": 60,
      "name": "Blindsight"
    },
    {
      "distance": 120,
      "name": "Darkvision"
    }
  ],
  "size": "Huge",
  "skills": [
    {
      "abilityName": "dex",
      "name": "Acrobatics",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Animal Handling",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Arcana",
      "proficient": false
    },
    {
      "abilityName": "str",
      "name": "Athletics",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Deception",
      "proficient": true
    },
    {
      "abilityName": "int",
      "name": "History",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Insight",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Intimidation",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Investigation",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Medicine",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Nature",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "bonus": 5,
      "name": "Perception",
      "proficient": true
    },
    {
      "abilityName": "cha",
      "name": "Performance",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Persuasion",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Religion",
      "proficient": false
    },
    {
      "abilityName": "dex",
      "name": "Sleight of Hand",
      "proficient": false
    },
    {
      "abilityName": "dex",
      "name": "Stealth",
      "proficient": true
    },
    {
      "abilityName": "wis",
      "name": "Survival",
      "proficient": false
    }
  ],
  "speed": 30,
  "systemKey": "5e",
  "textBlocks": [
    {
      "title": "Class Features"
    },
    {
      "title": "Racial Traits"
    },
    {
      "title": "Feats"
    },
    {
      "textBlocks": [
        {
        },
        {
        }
      ],
      "title": "Background"
    },
    {
      "textBlocks": [
        {
          "title": "Personality Traits"
        },
        {
          "title": "Ideals"
        },
        {
          "title": "Bonds"
        },
        {
          "title": "Flaws"
        }
      ],
      "title": "Characteristics"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Appearance"
    },
    {
      "title": "Organizations"
    },
    {
      "title": "Allies"
    },
    {
      "title": "Enemies"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Backstory"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Other"
    },
    {
      "textBlocks": [
        {
          "body": "If the dragon fails a saving throw, it can choose to succeed instead.",
          "title": "Legendary Resistance (3/Day)"
        },
        {
          "body": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.",
          "title": "Multiattack"
        },
        {
          "body": "The dragon uses one of the following breath weapons.\n\nAcid Breath. The dragon exhales acid in a 60-foot line that is 5 feet wide. Each creature in that line must make a DC 18 Dexterity saving throw, taking 54 (12d8) acid damage on a failed save, or half as much damage on a successful one.\n\nSlowing Breath. The dragon exhales gas in a 60-foot cone. Each creature in that area must succeed on a DC 18 Constitution saving throw. On a failed save, the creature can't use reactions, its speed is halved, and it can't make more than one attack on its turn. In addition, the creature can use either an action or a bonus action on its turn, but not both. These effects last for 1 minute. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself with a successful save.",
          "title": "Breath Weapons (Recharge 5-6)"
        },
        {
          "body": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.\n\nDetect. The dragon makes a Wisdom (Perception) check.\n\nTail Attack. The dragon makes a tail attack.\n\nWing Attack (Costs 2 Actions). The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 19 Dexterity saving throw or take 13 (2d6 + 6) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed.",
          "title": "Legendary Actions"
        },
        {
          "body": "On initiative count 20 (losing initiative ties), the dragon takes a lair action to cause one of the following effects:\n\n* The dragon chooses a point on the ground that it can see within 120 feet of it. Stone spikes sprout from the ground in a 20-foot radius centered on that point. The effect is otherwise identical to the spike growth spell and lasts until the dragon uses this lair action again or until the dragon dies.\n\n* The dragon chooses a 10-foot-square area on the ground that it can see within 120 feet of it. The ground in that area turns into 3-foot-deep mud. Each creature on the ground in that area when the mud appears must succeed on a DC 15 Dexterity saving throw or sink into the mud and become restrained. A creature can take an action to attempt a DC 15 Strength check, freeing itself or another creature within its reach and ending the restrained condition on a success. Moving 1 foot in the mud costs 2 feet of movement. On initiative count 20 on the next round, the mud hardens, and the Strength DC to work free increases to 20.",
          "title": "Lair Actions"
        },
        {
          "body": " At your discretion, a legendary (adult or ancient) copper dragon can use one or both of the following additional lair actions while in its lair:\n\nLaughing Gas. The dragon chooses a point on the ground that it can see within 120 feet of it. A cloud of pink gas fills a 20-foot-radius sphere centered on that point. Each creature in that area that fails a DC 15 Wisdom saving throw is incapacitated with laughter until the end of its next turn.\n\nTorpid Energy. The dragon chooses a creature it can see within 120 feet of it. If the target fails a DC 15 Constitution saving throw, its speed is halved, and it can't use reactions or bonus actions until the end of its next turn.",
          "title": "Additional Lair Actions"
        },
        {
          "body": "The region containing a legendary copper dragon's lair is warped by the dragon's magic, which creates one or more of the following effects:\n\n* Magic carvings of the dragon's smiling visage can be seen worked into stone terrain and objects within 6 miles of the dragon's lair.\n\n* Tiny beasts such as rodents and birds that are normally unable to speak gain the magical ability to speak and understand Draconic while within 1 mile of the dragon's lair. These creatures speak well of the dragon, but can't divulge its whereabouts.\n\n* Intelligent creatures within 1 mile of the dragon's lair are prone to fits of giggling. Even serious matters suddenly seem amusing.\n\nIf the dragon dies, the magic carvings fade over the course of 1d10 days. The other effects end immediately.",
          "title": "Regional Effects"
        },
        {
          "body": "Either of these effects might appear in the area around a copper dragon's lair, in addition to or instead of the effects described in the Monster Manual:\n\nDistant Melodies. The ethereal music of woodwinds and bells can be heard carried on the wind within 1 mile of the dragon's lair.\n\nStarlit Stones. Standing stones are common on hilltops within 1 mile of the dragon's lair. The stones shed dim light in a 10-foot radius at night. (If the dragon dies, the stones remain, but they no longer shed light.)",
          "title": "Additional Regional Effects"
        },
        {
          "body": "You can customize any dragon's stat block to reflect the dragon's unique character. Minor changes such as those below are easy to make and have no impact on a dragon's challenge rating.\n\nLanguages. Most dragons prefer to speak Draconic but learn Common for dealing with allies and minions. But given their high Intelligence and long life span, dragons can easily learn additional languages. You can add languages to a dragon's stat block.\n\nSkills. Most dragons are proficient in the Perception and Stealth skills, and many dragons have additional skill proficiencies. As with languages, you can customize a dragon's skill list (even doubling their proficiency bonus with certain skills) to reflect particular interests and activities. You can also give a dragon tool proficiencies, particularly if the dragon spends time in Humanoid form.\n\nSpells. See the \"Variant: Dragons as Innate Spellcasters\" inset(s), below.\n\nOther Traits and Actions. You can borrow traits and actions from other monsters to add unique flavor to a dragon. Consider these examples:\n\nChange Shape. You can decide that a dragon acquires this action at a younger age than usual, particularly if you want to feature a dragon in Humanoid form in your campaign:\nThe dragon magically polymorphs into a humanoid or beast that has a challenge rating no higher than its own, or back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (the dragon's choice).\nIn a new form, the dragon retains its alignment, hit points, Hit Dice, ability to speak, proficiencies, Legendary Resistance, lair actions, and Intelligence, Wisdom, and Charisma scores, as well as this action. Its statistics and capabilities are otherwise replaced by those of the new form, except any class features or legendary actions of that form.\n\nFlyby, The dragon is an agile flier, quick to fly out of enemies' reach.\nThe dragon doesn't provoke an opportunity attack when it flies out of an enemy's reach.\n\nMimicry. Impersonating characters or their allies could be a fun trick for a crafty dragon.\nThe dragon can mimic any sounds it has heard, including voices. A creature that hears the sounds can tell they are imitations with a successful DC 16 Wisdom (Insight) check.\n\nRejuvenation. You might decide that dragons in your campaign, being an essential part of the Material Plane, are nearly impossible to destroy. A dragon's life essence might be preserved in the egg from which it first emerged, in its hoard, or in a cavernous hall at the center of the world, just as a lich's essence is hidden in a phylactery.\nIf it has an essence-preserving object, a destroyed dragon gains a new body in 1d10 days, regaining all its hit points and becoming active again. The new body appears within 5 feet of the object.\n\nSpecial Senses. Most dragons have blindsight and darkvision. You might upgrade blindsight to truesight, or you could give a dragon with a burrowing speed tremorsense.",
          "title": "Customizing Dragons"
        },
        {
          "body": "This dragon can innately cast three spells, once per day each, requiring no material components. Each spell's level can be no higher than 4th. The dragon's spell save DC is DC 16, and it has +8 to hit with spell attacks.\n   A suggested spell list is shown below, but you can also choose spells to reflect the dragon's character. A dragon who innately casts druid spells feels different from one who casts warlock spells. You can also give a dragon spells of a higher level than this rule allows, but such a tweak might increase the dragon's challenge rating—especially if those spells deal damage or impose conditions on targets.\n\n* lesser restoration\n\n* phantasmal force\n\n* stone shape",
          "title": "Variant: Dragons as Innate Spellcasters"
        },
        {
          "body": "Dragons are innately magical creatures that can master a few spells as they age, using this variant.\n   A young or older dragon can innately cast a number of spells equal to its Charisma modifier. Each spell can be cast once per day, requiring no material components, and the spell's level can be no higher than one-third the dragon's challenge rating (rounded down). The dragon's bonus to hit with spell attacks is equal to its proficiency bonus + its Charisma bonus. The dragon's spell save DC equals 8 + its proficiency bonus + its Charisma modifier.\n   This dragon can innately cast three spells, once per day each, requiring no material components. Each spell's level can be no higher than 4th. The dragon's spell save DC is DC 16, and it has +8 to hit with spell attacks. See the spell page for a list of spells the dragon is capable of casting. A selection of examples are shown below:\n\n* polymorph\n\n* greater invisibility\n\n* confusion\n\n* stinking cloud\n\n* major image\n\n* charm monster",
          "title": "Variant: Dragons as Innate Spellcasters "
        }
      ],
      "title": "Abilities"
    }
  ],
  "trackers": [
    {
      "color": "Yellow",
      "max": 355000,
      "name": "XP",
      "type": "Bar",
      "value": 11500
    },
    {
      "color": "Green",
      "max": 184,
      "name": "HP",
      "type": "Bar",
      "value": 184
    }
  ],
  "type": "Dragon"
}