{
  "abilityScores": [
    {
      "name": "str",
      "value": 27
    },
    {
      "name": "dex",
      "value": 10
    },
    {
      "name": "con",
      "value": 25
    },
    {
      "name": "int",
      "value": 16
    },
    {
      "name": "wis",
      "value": 13
    },
    {
      "name": "cha",
      "value": 21
    }
  ],
  "actions": [
    {
      "description": "Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 19 (2d10 + 8) piercing damage plus 7 (2d6) fire damage.",
      "name": "Bite ",
      "sortOrder": 0,
      "steps": [
        {
          "attack": {
            "ability": "str",
            "crit": 20,
            "damageRolls": [
              {
                "abilityName": "str",
                "dice": "2d10",
                "type": "Piercing"
              },
              {
                "dice": "2d6",
                "type": "Fire"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Bite ",
            "rollsAttack": true,
            "savingThrow": {
            }
          },
          "journalCommand": {
          },
          "skillCheck": {
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "Melee Weapon Attack: +14 to hit, reach 5 ft., one target. Hit: 15 (2d6 + 8) slashing damage.",
      "name": "Claw",
      "sortOrder": 1,
      "steps": [
        {
          "attack": {
            "ability": "str",
            "crit": 20,
            "damageRolls": [
              {
                "abilityName": "str",
                "dice": "2d6",
                "type": "Slashing"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Claw",
            "rollsAttack": true
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "Melee Weapon Attack: +14 to hit, reach 15 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage.",
      "name": "Tail",
      "sortOrder": 2,
      "steps": [
        {
          "attack": {
            "ability": "str",
            "crit": 20,
            "damageRolls": [
              {
                "abilityName": "str",
                "dice": "2d8",
                "type": "Bludgeoning"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Tail",
            "rollsAttack": true
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 19 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.",
      "name": "Frightful Presence",
      "sortOrder": 3,
      "steps": [
        {
          "attack": {
            "crit": 20,
            "isProficient": true,
            "isRanged": false,
            "name": "Frightful Presence",
            "rollsAttack": false,
            "savingThrow": {
              "abilityName": "wis",
              "difficultyClass": 19
            }
          },
          "journalCommand": {
          },
          "skillCheck": {
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "The dragon exhales fire in a 60-foot cone. Each creature in that area must make a DC 21 Dexterity saving throw, taking 63 (18d6) fire damage on a failed save, or half as much damage on a successful one.",
      "name": "Fire Breath (Recharge 5-6)",
      "sortOrder": 4,
      "steps": [
        {
          "attack": {
            "crit": 20,
            "damageRolls": [
              {
                "dice": "18d6",
                "type": "Fire"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Fire Breath (Recharge 5-6)",
            "rollsAttack": false,
            "savingThrow": {
              "abilityName": "dex",
              "difficultyClass": 21
            }
          },
          "journalCommand": {
          },
          "skillCheck": {
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 22 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed.",
      "name": "Wing Attack (Costs 2 Actions)",
      "sortOrder": 5,
      "steps": [
        {
          "attack": {
            "crit": 20,
            "damageRolls": [
              {
                "abilityName": "str",
                "dice": "2d6",
                "type": "Bludgeoning"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Wing Attack (Costs 2 Actions)",
            "rollsAttack": false,
            "savingThrow": {
              "abilityName": "dex",
              "difficultyClass": 22
            }
          },
          "journalCommand": {
          },
          "skillCheck": {
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "A cloud of thick, dark smoke fills a 20-foot-radius sphere centered on a point the dragon can see within 120 feet of it. The sphere spreads around corners, and its area is heavily obscured. A creature other than the dragon that starts its turn in the cloud or enters it for the first time on its turn must succeed on a DC 15 Constitution saving throw or be poisoned until the end of its turn. The cloud lasts until initiative count 20 on the next round.",
      "name": "Noxious Smoke",
      "sortOrder": 6,
      "steps": [
        {
          "attack": {
            "crit": 20,
            "isProficient": true,
            "isRanged": false,
            "name": "Noxious Smoke",
            "rollsAttack": false,
            "savingThrow": {
              "abilityName": "CON",
              "difficultyClass": 15
            }
          },
          "journalCommand": {
          },
          "skillCheck": {
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "Searing heat spreads out in a 15-foot-radius sphere centered on a point the dragon can see within 120 feet of it. Any creature that enters the affected area or starts its turn there must make a DC 15 Constitution saving throw, taking 10 (3d6) fire damage on a failed save, or half as much damage on a successful one. The heat lasts until initiative count 20 on the next round.",
      "name": "Searing Heat",
      "sortOrder": 7,
      "steps": [
        {
          "attack": {
            "crit": 20,
            "damageRolls": [
              {
                "dice": "3d6",
                "type": "Fire"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Searing Heat",
            "rollsAttack": false,
            "savingThrow": {
              "abilityName": "CON",
              "difficultyClass": 15
            }
          },
          "journalCommand": {
          },
          "skillCheck": {
          },
          "type": "custom-attack"
        }
      ]
    }
  ],
  "alignment": "Chaotic Evil",
  "armorClass": 19,
  "armorType": "Natural Armor",
  "challengeRating": "17",
  "classes": [
    {
      "class": "Monster",
      "level": 1
    }
  ],
  "currentHp": 256,
  "damageImmunities": [
    {
      "damageType": "Fire"
    }
  ],
  "exp": 18000,
  "hitDice": "19d12+133",
  "imageUri": "https://cdn.alchemyrpg.com/app-assets/dragon-token.svg",
  "initiativeBonus": 0,
  "isNPC": true,
  "maxHp": 256,
  "movementModes": [
    {
      "distance": 40,
      "mode": "Walking"
    },
    {
      "distance": 40,
      "mode": "Climb"
    },
    {
      "distance": 80,
      "mode": "Fly"
    }
  ],
  "name": "Adult Red Dragon",
  "proficiencies": [
    {
      "name": "Dexterity",
      "type": "save"
    },
    {
      "name": "Constitution",
      "type": "save"
    },
    {
      "name": "Wisdom",
      "type": "save"
    },
    {
      "name": "Charisma",
      "type": "save"
    },
    {
      "name": "Common",
      "type": "language"
    },
    {
      "name": "Draconic",
      "type": "language"
    }
  ],
  "proficiencyBonus": 6,
  "race": "NPC",
  "senses": [
    {
      "distance": 60,
      "name": "Blindsight"
    },
    {
      "distance": 120,
      "name": "Darkvision"
    }
  ],
  "size": "Huge",
  "skills": [
    {
      "abilityName": "dex",
      "name": "Acrobatics",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Animal Handling",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Arcana",
      "proficient": false
    },
    {
      "abilityName": "str",
      "name": "Athletics",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Deception",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "History",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Insight",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Intimidation",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Investigation",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Medicine",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Nature",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "bonus": 6,
      "name": "Perception",
      "proficient": true
    },
    {
      "abilityName": "cha",
      "name": "Performance",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Persuasion",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Religion",
      "proficient": false
    },
    {
      "abilityName": "dex",
      "name": "Sleight of Hand",
      "proficient": false
    },
    {
      "abilityName": "dex",
      "name": "Stealth",
      "proficient": true
    },
    {
      "abilityName": "wis",
      "name": "Survival",
      "proficient": false
    }
  ],
  "speed": 30,
  "systemKey": "5e",
  "textBlocks": [
    {
      "title": "Class Features"
    },
    {
      "title": "Racial Traits"
    },
    {
      "title": "Feats"
    },
    {
      "textBlocks": [
        {
        },
        {
        }
      ],
      "title": "Background"
    },
    {
      "textBlocks": [
        {
          "title": "Personality Traits"
        },
        {
          "title": "Ideals"
        },
        {
          "title": "Bonds"
        },
        {
          "title": "Flaws"
        }
      ],
      "title": "Characteristics"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Appearance"
    },
    {
      "title": "Organizations"
    },
    {
      "title": "Allies"
    },
    {
      "title": "Enemies"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Backstory"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Other"
    },
    {
      "textBlocks": [
        {
          "body": "If the dragon fails a saving throw, it can choose to succeed instead.\n",
          "title": "Legendary Resistance (3/Day)"
        },
        {
          "body": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.",
          "title": "Multiattack"
        },
        {
          "body": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.\n\nDetect. The dragon makes a Wisdom (Perception) check.\n\nTail Attack. The dragon makes a tail attack.\n\nWing Attack (Costs 2 Actions). The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 22 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed.",
          "title": "Legendary Actions"
        },
        {
          "body": "On initiative count 20 (losing initiative ties), the dragon takes a lair action to cause one of the following effects; the dragon can't use the same effect two rounds in a row:\n\n* Magma erupts from a point on the ground the dragon can see within 120 feet of it, creating a 20-foot-high, 5-foot-radius geyser. Each creature in the geyser's area must make a DC 15 Dexterity saving throw, taking 21 (6d6) fire damage on a failed save, or half as much damage on a successful one.\n\n* A tremor shakes the lair in a 60-foot radius around the dragon. Each creature other than the dragon on the ground in that area must succeed on a DC 15 Dexterity saving throw or be knocked prone.\n\n* Volcanic gases form a cloud in a 20-foot-radius sphere centered on a point the dragon can see within 120 feet of it. The sphere spreads around corners, and its area is lightly obscured. It lasts until initiative count 20 on the next round. Each creature that starts its turn in the cloud must succeed on a DC 13 Constitution saving throw or be poisoned until the end of its turn. While poisoned in this way, a creature is incapacitated.",
          "title": "Lair Actions"
        },
        {
          "body": " At your discretion, a legendary (adult or ancient) red dragon can use one or both of the following additional lair actions while in its lair:\n\nNoxious Smoke. A cloud of thick, dark smoke fills a 20-foot-radius sphere centered on a point the dragon can see within 120 feet of it. The sphere spreads around corners, and its area is heavily obscured. A creature other than the dragon that starts its turn in the cloud or enters it for the first time on its turn must succeed on a DC 15 Constitution saving throw or be poisoned until the end of its turn. The cloud lasts until initiative count 20 on the next round.\n\nSearing Heat. Searing heat spreads out in a 15-foot-radius sphere centered on a point the dragon can see within 120 feet of it. Any creature that enters the affected area or starts its turn there must make a DC 15 Constitution saving throw, taking 10 (3d6) fire damage on a failed save, or half as much damage on a successful one. The heat lasts until initiative count 20 on the next round.",
          "title": "Additional Lair Actions"
        },
        {
          "body": "The region containing a legendary red dragon's lair is warped by the dragon's magic, which creates one or more of the following effects:\n\n* Small earthquakes are common within 6 miles of the dragon's lair.\n\n* Water sources within 1 mile of the lair are supernaturally warm and tainted by sulfur.\n\n* Rocky fissures within 1 mile of the dragon's lair form portals to the Elemental Plane of Fire, allowing creatures of elemental fire into the world to dwell nearby.\n\nIf the dragon dies, these effects fade over the course of 1d10 days.",
          "title": "Regional Effects"
        },
        {
          "body": "Any of these effects might appear in the area around a red dragon's lair, in addition to or instead of the effects described in the Monster Manual:\n\nDesertification. Precipitation is almost nonexistent within 6 miles of the dragon's lair, making the land parched and arid and most plant life withered and brown.\n\nFiery Senses. The dragon can hear up to 30 feet through any open flame within 1 mile of the dragon's lair.\n\nOminous Flames. Open flames within 6 miles of the dragon's lair are tinged dark red, hiss and crackle constantly, and throw off embers and showers of sparks.",
          "title": "Additional Regional Effects"
        },
        {
          "body": "You can customize any dragon's stat block to reflect the dragon's unique character. Minor changes such as those below are easy to make and have no impact on a dragon's challenge rating.\n\nLanguages. Most dragons prefer to speak Draconic but learn Common for dealing with allies and minions. But given their high Intelligence and long life span, dragons can easily learn additional languages. You can add languages to a dragon's stat block.\n\nSkills. Most dragons are proficient in the Perception and Stealth skills, and many dragons have additional skill proficiencies. As with languages, you can customize a dragon's skill list (even doubling their proficiency bonus with certain skills) to reflect particular interests and activities. You can also give a dragon tool proficiencies, particularly if the dragon spends time in Humanoid form.\n\nSpells. See the \"Variant: Dragons as Innate Spellcasters\" inset(s), below.\n\nOther Traits and Actions. You can borrow traits and actions from other monsters to add unique flavor to a dragon. Consider these examples:\n\nDamage Absorption. You might decide that this dragon is not only unharmed by fire damage, but actually healed by it.\nWhenever the dragon is subjected to fire damage, it takes no damage and instead regains a number of hit points equal to the fire damage dealt.\n\nFlyby, The dragon is an agile flier, quick to fly out of enemies' reach.\nThe dragon doesn't provoke an opportunity attack when it flies out of an enemy's reach.\n\nMimicry. Impersonating characters or their allies could be a fun trick for a crafty dragon.\nThe dragon can mimic any sounds it has heard, including voices. A creature that hears the sounds can tell they are imitations with a successful DC 13 Wisdom (Insight) check.\n\nRejuvenation. You might decide that dragons in your campaign, being an essential part of the Material Plane, are nearly impossible to destroy. A dragon's life essence might be preserved in the egg from which it first emerged, in its hoard, or in a cavernous hall at the center of the world, just as a lich's essence is hidden in a phylactery.\nIf it has an essence-preserving object, a destroyed dragon gains a new body in 1d10 days, regaining all its hit points and becoming active again. The new body appears within 5 feet of the object.\n\nSpecial Senses. Most dragons have blindsight and darkvision. You might upgrade blindsight to truesight, or you could give a dragon with a burrowing speed tremorsense.",
          "title": "Customizing Dragons"
        },
        {
          "body": "This dragon can innately cast five spells, once per day each, requiring no material components. Each spell's level can be no higher than 5th. The dragon's spell save DC is DC 19, and it has +11 to hit with spell attacks.\n   A suggested spell list is shown below, but you can also choose spells to reflect the dragon's character. A dragon who innately casts druid spells feels different from one who casts warlock spells. You can also give a dragon spells of a higher level than this rule allows, but such a tweak might increase the dragon's challenge rating—especially if those spells deal damage or impose conditions on targets.\n\n* bane\n\n* dominate person\n\n* heat metal\n\n* hypnotic pattern\n\n*suggestion",
          "title": "Variant: Dragons as Innate Spellcaster"
        },
        {
          "body": "Dragons are innately magical creatures that can master a few spells as they age, using this variant.\n   A young or older dragon can innately cast a number of spells equal to its Charisma modifier. Each spell can be cast once per day, requiring no material components, and the spell's level can be no higher than one-third the dragon's challenge rating (rounded down). The dragon's bonus to hit with spell attacks is equal to its proficiency bonus + its Charisma bonus. The dragon's spell save DC equals 8 + its proficiency bonus + its Charisma modifier.\n   This dragon can innately cast five spells, once per day each, requiring no material components. Each spell's level can be no higher than 5th. The dragon's spell save DC is DC 19, and it has +11 to hit with spell attacks. See the spell page for a list of spells the dragon is capable of casting. A selection of examples are shown below:\n\n* fireball\n\n* scorching ray\n\n* haste\n\n* erupting earth\n\n* Aganazzar's scorcher",
          "title": "Variant: Dragons as Innate Spellcasters"
        }
      ],
      "title": "Abilities"
    }
  ],
  "trackers": [
    {
      "color": "Yellow",
      "max": 355000,
      "name": "XP",
      "type": "Bar",
      "value": 18000
    },
    {
      "color": "Green",
      "max": 256,
      "name": "HP",
      "type": "Bar",
      "value": 256
    }
  ],
  "type": "Dragon"
}