{
  "abilityScores": [
    {
      "name": "str",
      "value": 23
    },
    {
      "name": "dex",
      "value": 12
    },
    {
      "name": "con",
      "value": 21
    },
    {
      "name": "int",
      "value": 18
    },
    {
      "name": "wis",
      "value": 15
    },
    {
      "name": "cha",
      "value": 17
    }
  ],
  "actions": [
    {
      "description": "Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage plus 7 (2d6) poison damage.",
      "name": "Bite",
      "sortOrder": 0,
      "steps": [
        {
          "attack": {
            "ability": "str",
            "crit": 20,
            "damageRolls": [
              {
                "abilityName": "str",
                "dice": "2d6",
                "type": "Piercing"
              },
              {
                "dice": "2d6",
                "type": "Poison"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Bite",
            "rollsAttack": true,
            "savingThrow": {
            }
          },
          "journalCommand": {
          },
          "skillCheck": {
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage.",
      "name": "Claw",
      "sortOrder": 1,
      "steps": [
        {
          "attack": {
            "ability": "str",
            "crit": 20,
            "damageRolls": [
              {
                "abilityName": "str",
                "dice": "2d6",
                "type": "Slashing"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Claw",
            "rollsAttack": true
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "Melee Weapon Attack: +11 to hit, reach 15 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage.",
      "name": "Tail",
      "sortOrder": 2,
      "steps": [
        {
          "attack": {
            "ability": "str",
            "crit": 20,
            "damageRolls": [
              {
                "abilityName": "str",
                "dice": "2d8",
                "type": "Bludgeoning"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Tail",
            "rollsAttack": true
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 16 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.",
      "name": "Frightful Presence",
      "sortOrder": 3,
      "steps": [
        {
          "attack": {
            "crit": 20,
            "isProficient": true,
            "isRanged": false,
            "name": "Frightful Presence",
            "rollsAttack": false,
            "savingThrow": {
              "abilityName": "wis",
              "difficultyClass": 16
            }
          },
          "journalCommand": {
          },
          "skillCheck": {
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "The dragon exhales poisonous gas in a 60-foot cone. Each creature in that area must make a DC 18 Constitution saving throw, taking 56 (16d6) poison damage on a failed save, or half as much damage on a successful one.",
      "name": "Poison Breath (Recharges 5-6)",
      "sortOrder": 4,
      "steps": [
        {
          "attack": {
            "crit": 20,
            "damageRolls": [
              {
                "dice": "16d6",
                "type": "Poison"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Poison Breath (Recharges 5-6)",
            "rollsAttack": false,
            "savingThrow": {
              "abilityName": "CON",
              "difficultyClass": 18
            }
          },
          "journalCommand": {
          },
          "skillCheck": {
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 19 Dexterity saving throw or take 13 (2d6 + 6) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed.",
      "name": "Wing Attack (Costs 2 Actions)",
      "sortOrder": 5,
      "steps": [
        {
          "attack": {
            "crit": 20,
            "damageRolls": [
              {
                "abilityName": "str",
                "dice": "2d6",
                "type": "Bludgeoning"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Wing Attack (Costs 2 Actions)",
            "rollsAttack": false,
            "savingThrow": {
              "abilityName": "dex",
              "difficultyClass": 19
            }
          },
          "journalCommand": {
          },
          "skillCheck": {
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "One large root or branch that is part of the lair makes a melee attack roll against a creature within 10 feet of it. It has a +7 bonus to hit and deals 10 (3d6) bludgeoning damage on a hit. If the target is a Medium or smaller creature, it must succeed on a DC 15 Strength saving throw or be knocked prone.",
      "name": "Lashing Root",
      "sortOrder": 6,
      "steps": [
        {
          "attack": {
            "crit": 20,
            "damageRolls": [
              {
                "dice": "3d6",
                "type": "Bludgeoning"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Lashing Root",
            "rollsAttack": false,
            "savingThrow": {
              "difficultyClass": 15
            }
          },
          "journalCommand": {
          },
          "skillCheck": {
          },
          "type": "custom-attack"
        }
      ]
    }
  ],
  "alignment": "Lawful Evil",
  "armorClass": 19,
  "armorType": "Natural Armor",
  "challengeRating": "15",
  "classes": [
    {
      "class": "Monster",
      "level": 1
    }
  ],
  "conditionImmunities": [
    "Poisoned"
  ],
  "currentHp": 207,
  "damageImmunities": [
    {
      "damageType": "Poison"
    }
  ],
  "exp": 13000,
  "hitDice": "18d12+90",
  "imageUri": "https://cdn.alchemyrpg.com/app-assets/dragon-token.svg",
  "initiativeBonus": 0,
  "isNPC": true,
  "maxHp": 207,
  "movementModes": [
    {
      "distance": 40,
      "mode": "Walking"
    },
    {
      "distance": 80,
      "mode": "Fly"
    },
    {
      "distance": 40,
      "mode": "Swim"
    }
  ],
  "name": "Adult Green Dragon",
  "proficiencies": [
    {
      "name": "Dexterity",
      "type": "save"
    },
    {
      "name": "Constitution",
      "type": "save"
    },
    {
      "name": "Wisdom",
      "type": "save"
    },
    {
      "name": "Charisma",
      "type": "save"
    },
    {
      "name": "Common",
      "type": "language"
    },
    {
      "name": "Draconic",
      "type": "language"
    }
  ],
  "proficiencyBonus": 5,
  "race": "NPC",
  "senses": [
    {
      "distance": 60,
      "name": "Blindsight"
    },
    {
      "distance": 120,
      "name": "Darkvision"
    }
  ],
  "size": "Huge",
  "skills": [
    {
      "abilityName": "dex",
      "name": "Acrobatics",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Animal Handling",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Arcana",
      "proficient": false
    },
    {
      "abilityName": "str",
      "name": "Athletics",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Deception",
      "proficient": true
    },
    {
      "abilityName": "int",
      "name": "History",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Insight",
      "proficient": true
    },
    {
      "abilityName": "cha",
      "name": "Intimidation",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Investigation",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Medicine",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Nature",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "bonus": 5,
      "name": "Perception",
      "proficient": true
    },
    {
      "abilityName": "cha",
      "name": "Performance",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Persuasion",
      "proficient": true
    },
    {
      "abilityName": "int",
      "name": "Religion",
      "proficient": false
    },
    {
      "abilityName": "dex",
      "name": "Sleight of Hand",
      "proficient": false
    },
    {
      "abilityName": "dex",
      "name": "Stealth",
      "proficient": true
    },
    {
      "abilityName": "wis",
      "name": "Survival",
      "proficient": false
    }
  ],
  "speed": 30,
  "systemKey": "5e",
  "textBlocks": [
    {
      "title": "Class Features"
    },
    {
      "title": "Racial Traits"
    },
    {
      "title": "Feats"
    },
    {
      "textBlocks": [
        {
        },
        {
        }
      ],
      "title": "Background"
    },
    {
      "textBlocks": [
        {
          "title": "Personality Traits"
        },
        {
          "title": "Ideals"
        },
        {
          "title": "Bonds"
        },
        {
          "title": "Flaws"
        }
      ],
      "title": "Characteristics"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Appearance"
    },
    {
      "title": "Organizations"
    },
    {
      "title": "Allies"
    },
    {
      "title": "Enemies"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Backstory"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Other"
    },
    {
      "textBlocks": [
        {
          "body": "The dragon can breathe air and water.",
          "title": "Amphibious"
        },
        {
          "body": "If the dragon fails a saving throw, it can choose to succeed instead.",
          "title": "Legendary Resistance (3/Day)"
        },
        {
          "body": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.",
          "title": "Multiattack"
        },
        {
          "body": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.\n\nDetect. The dragon makes a Wisdom (Perception) check.\n\nTail Attack. The dragon makes a tail attack.\n\nWing Attack (Costs 2 Actions). The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 19 Dexterity saving throw or take 13 (2d6 + 6) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed.",
          "title": "Legendary Actions"
        },
        {
          "body": "On initiative count 20 (losing initiative ties), the dragon takes a lair action to cause one of the following effects; the dragon can't use the same effect two rounds in a row:\n\n* Grasping roots and vines erupt in a 20-foot radius centered on a point on the ground that the dragon can see within 120 feet of it. That area becomes difficult terrain, and each creature there must succeed on a DC 15 Strength saving throw or be restrained by the roots and vines. A creature can be freed if it or another creature takes an action to make a DC 15 Strength check and succeeds. The roots and vines wilt away when the dragon uses this lair action again or when the dragon dies.\n\n* A wall of tangled brush bristling with thorns springs into existence on a solid surface within 120 feet of the dragon. The wall is up to 60 feet long, 10 feet high, and 5 feet thick, and it blocks line of sight. When the wall appears, each creature in its area must make a DC 15 Dexterity saving throw. A creature that fails the save takes 18 (4d8) piercing damage and is pushed 5 feet out of the wall's space, appearing on whichever side of the wall it wants. A creature can move through the wall, albeit slowly and painfully. For every 1 foot a creature travels through the wall, it must spend 4 feet of movement. Furthermore, a creature in the wall's space must make a DC 15 Dexterity saving throw once each round it's in contact with the wall, taking 18 (4d8) piercing damage on a failed save, or half as much damage on a successful one. Each 10-foot section of wall has AC 5, 15 hit points, vulnerability to fire damage, resistance to bludgeoning and piercing damage, and immunity to psychic damage. The wall sinks back into the ground when the dragon uses this lair action again or when the dragon dies.\n\n* Magical fog billows around one creature the dragon can see within 120 feet of it. The creature must succeed on a DC 15 Wisdom saving throw or be charmed by the dragon until initiative count 20 on the next round.",
          "title": "Lair Actions"
        },
        {
          "body": "At your discretion, a legendary (adult or ancient) green dragon can use one or both of the following additional lair actions while in its lair:\n\nCreeper Vines. The dragon can use the vines and roots within its lair to animate up to three Humanoid corpses, which become zombies. The zombies take their turn immediately after this lair action. Each one reverts to an inanimate corpse after 1 minute, when the dragon uses this lair action again, or when the zombie is destroyed.\n\nLashing Root. One large root or branch that is part of the lair makes a melee attack roll against a creature within 10 feet of it. It has a +7 bonus to hit and deals 10 (3d6) bludgeoning damage on a hit. If the target is a Medium or smaller creature, it must succeed on a DC 15 Strength saving throw or be knocked prone.",
          "title": "Additional Lair Actions"
        },
        {
          "body": "The region containing a legendary green dragon's lair is warped by the dragon's magic, which creates one or more of the following effects:\n\n* Thickets form labyrinthine passages within 1 mile of the dragon's lair. The thickets act as 10-foot-high, 10-foot-thick walls that block line of sight. Creatures can move through the thickets, with every 1 foot a creature moves costing it 4 feet of movement. A creature in the thickets must make a DC 15 Dexterity saving throw once each round it's in contact with the 'thickets or take 3 (1d6) piercing damage from thorns.\n\n* Each 10-foot-cube of thickets has AC 5, 30 hit points, resistance to bludgeoning and piercing damage, vulnerability to fire damage, and immunity to psychic and thunder damage.\n\n* Within 1 mile of its lair, the dragon leaves no physical evidence of its passage unless it wishes to. Tracking it there is impossible except by magical means. In addition, it ignores movement impediments and damage from plants in this area that are neither magical nor creatures, including the thickets described above. The plants remove themselves from the dragon's path.\nRodents and birds within 1 mile of the dragon's lair serve as the dragon's eyes and ears. Deer and other large game are strangely absent, hinting at the presence of an unnaturally hungry predator.\n\nIf the dragon dies, the rodents and birds lose their supernatural link to it. The thickets remain, but within 1d10 days, they become mundane plants and normal difficult terrain, losing their thorns.",
          "title": "Regional Effects"
        },
        {
          "body": "Either or both of these effects might appear in the area around a green dragon's lair, in addition to or instead of those described in the Monster Manual:\n\nInviting Whispers. Whispers rustle in the foliage within 1 mile of the dragon's lair. The words are indistinct, but a creature with an Intelligence score of 5 or higher interprets them as an invitation to move deeper into the greenery.\n\nTwisted Messengers. The dragon can cause any Tiny Beast within 1 mile of its lair to act as its mouthpiece. The effect is horrendous, as the creature's throat and mouth temporarily warp into a twisted version of the dragon's own in order to allow the dragon's voice to issue forth.",
          "title": "Additional Regional Effects"
        },
        {
          "body": "You can customize any dragon's stat block to reflect the dragon's unique character. Minor changes such as those below are easy to make and have no impact on a dragon's challenge rating.\n\nLanguages. Most dragons prefer to speak Draconic but learn Common for dealing with allies and minions. But given their high Intelligence and long life span, dragons can easily learn additional languages. You can add languages to a dragon's stat block.\n\nSkills. Most dragons are proficient in the Perception and Stealth skills, and many dragons have additional skill proficiencies. As with languages, you can customize a dragon's skill list (even doubling their proficiency bonus with certain skills) to reflect particular interests and activities. You can also give a dragon tool proficiencies, particularly if the dragon spends time in Humanoid form.\n\nSpells. See the \"Variant: Dragons as Innate Spellcasters\" inset(s), below.\n\nOther Traits and Actions. You can borrow traits and actions from other monsters to add unique flavor to a dragon. Consider these examples:\n\nFlyby, The dragon is an agile flier, quick to fly out of enemies' reach.\nThe dragon doesn't provoke an opportunity attack when it flies out of an enemy's reach.\n\nMimicry. Impersonating characters or their allies could be a fun trick for a crafty dragon.\nThe dragon can mimic any sounds it has heard, including voices. A creature that hears the sounds can tell they are imitations with a successful DC 16 Wisdom (Insight) check.\n\nRejuvenation. You might decide that dragons in your campaign, being an essential part of the Material Plane, are nearly impossible to destroy. A dragon's life essence might be preserved in the egg from which it first emerged, in its hoard, or in a cavernous hall at the center of the world, just as a lich's essence is hidden in a phylactery.\nIf it has an essence-preserving object, a destroyed dragon gains a new body in 1d10 days, regaining all its hit points and becoming active again. The new body appears within 5 feet of the object.\n\nSpecial Senses. Most dragons have blindsight and darkvision. You might upgrade blindsight to truesight, or you could give a dragon with a burrowing speed tremorsense.",
          "title": "Customizing Dragons"
        },
        {
          "body": "This dragon can innately cast three spells, once per day each, requiring no material components. Each spell's level can be no higher than 5th. The dragon's spell save DC is DC 16, and it has +8 to hit with spell attacks.\n   A suggested spell list is shown below, but you can also choose spells to reflect the dragon's character. A dragon who innately casts druid spells feels different from one who casts warlock spells. You can also give a dragon spells of a higher level than this rule allows, but such a tweak might increase the dragon's challenge rating—especially if those spells deal damage or impose conditions on targets.\n\n* invisibility\n\n* plant growth\n\n* speak with animals",
          "title": "Variant: Dragons as Innate Spellcasters"
        },
        {
          "body": "Dragons are innately magical creatures that can master a few spells as they age, using this variant.\n   A young or older dragon can innately cast a number of spells equal to its Charisma modifier. Each spell can be cast once per day, requiring no material components, and the spell's level can be no higher than one-third the dragon's challenge rating (rounded down). The dragon's bonus to hit with spell attacks is equal to its proficiency bonus + its Charisma bonus. The dragon's spell save DC equals 8 + its proficiency bonus + its Charisma modifier.\n   This dragon can innately cast three spells, once per day each, requiring no material components. Each spell's level can be no higher than 5th. The dragon's spell save DC is DC 16, and it has +8 to hit with spell attacks. See the spell page for a list of spells the dragon is capable of casting. A selection of examples are shown below:\n\n *cloudkill\n\n* charm monster\n\n* modify memory\n\n* mislead\n\n* hallucinatory terrain\n\n* dimension door",
          "title": "Variant: Dragons as Innate Spellcasters"
        }
      ],
      "title": "Abilities"
    }
  ],
  "trackers": [
    {
      "color": "Yellow",
      "max": 355000,
      "name": "XP",
      "type": "Bar",
      "value": 13000
    },
    {
      "color": "Green",
      "max": 207,
      "name": "HP",
      "type": "Bar",
      "value": 207
    }
  ],
  "type": "Dragon"
}