{
  "abilityScores": [
    {
      "name": "str",
      "value": 18
    },
    {
      "name": "dex",
      "value": 12
    },
    {
      "name": "con",
      "value": 16
    },
    {
      "name": "int",
      "value": 13
    },
    {
      "name": "wis",
      "value": 14
    },
    {
      "name": "cha",
      "value": 14
    }
  ],
  "actions": [
    {
      "description": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) slashing damage.",
      "name": "Claws",
      "sortOrder": 0,
      "steps": [
        {
          "attack": {
            "ability": "str",
            "crit": 20,
            "damageRolls": [
              {
                "abilityName": "str",
                "dice": "2d8",
                "type": "Slashing"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Claws",
            "rollsAttack": true,
            "savingThrow": {
            }
          },
          "journalCommand": {
          },
          "skillCheck": {
          },
          "type": "custom-attack"
        }
      ]
    }
  ],
  "alignment": "Neutral Evil",
  "armorClass": 17,
  "armorType": "Natural Armor",
  "challengeRating": "3",
  "classes": [
    {
      "class": "Monster",
      "level": 1
    }
  ],
  "currentHp": 82,
  "exp": 700,
  "hitDice": "11d8+33",
  "imageUri": "https://cdn.alchemyrpg.com/app-assets/fey-token.svg",
  "initiativeBonus": 0,
  "isNPC": true,
  "isSpellcaster": true,
  "maxHp": 82,
  "movementModes": [
    {
      "distance": 30,
      "mode": "Walking"
    }
  ],
  "name": "Green Hag",
  "proficiencies": [
    {
      "name": "Common",
      "type": "language"
    },
    {
      "name": "Draconic",
      "type": "language"
    },
    {
      "name": "Sylvan",
      "type": "language"
    }
  ],
  "proficiencyBonus": 2,
  "race": "NPC",
  "senses": [
    {
      "distance": 60,
      "name": "Darkvision"
    }
  ],
  "size": "Medium",
  "skills": [
    {
      "abilityName": "dex",
      "name": "Acrobatics",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Animal Handling",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Arcana",
      "proficient": true
    },
    {
      "abilityName": "str",
      "name": "Athletics",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Deception",
      "proficient": true
    },
    {
      "abilityName": "int",
      "name": "History",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Insight",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Intimidation",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Investigation",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Medicine",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Nature",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Perception",
      "proficient": true
    },
    {
      "abilityName": "cha",
      "name": "Performance",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Persuasion",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Religion",
      "proficient": false
    },
    {
      "abilityName": "dex",
      "name": "Sleight of Hand",
      "proficient": false
    },
    {
      "abilityName": "dex",
      "name": "Stealth",
      "proficient": true
    },
    {
      "abilityName": "wis",
      "name": "Survival",
      "proficient": false
    }
  ],
  "speed": 30,
  "spellFilters": [
    "Known"
  ],
  "spellcastingAbility": "cha",
  "spells": [
    {
      "castingTime": "1 Action",
      "components": [
        "V",
        "S",
        "M"
      ],
      "description": "You create up to four torch-sized lights within range, making them appear as torches, lanterns, or glowing orbs that hover in the air for the duration. You can also combine the four lights into one glowing vaguely humanoid form of Medium size. Whichever form you choose, each light sheds dim light in a 10- foot radius. \n\nAs a bonus action on your turn, you can move the lights up to 60 feet to a new spot within range. A light must be within 20 feet of another light created by this spell, and a light winks out if it exceeds the spell's range.",
      "duration": "Up to 1 minute",
      "level": 0,
      "materials": "a bit of phosphorus or wychwood, or a glowworm",
      "name": "Dancing Lights",
      "range": "120 ft.",
      "requiresConcentration": true,
      "savingThrow": {
      },
      "school": "Evocation",
      "tags": [
        "Artificer",
        "Bard",
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "castingTime": "1 Action",
      "components": [
        "S",
        "M"
      ],
      "description": "You create a sound or an image of an object within range that lasts for the duration. The illusion also ends if you dismiss it as an action or cast this spell again.\n\nIf you create a sound, its volume can range from a whisper to a scream. It can be your voice, someone else's voice, a lion's roar, a beating of drums, or any other sound you choose. The sound continues unabated throughout the duration, or you can make discrete sounds at different times before the spell ends.\n\nIf you create an image of an object—such as a chair, muddy footprints, or a small chest—it must be no larger than a 5-foot cube. The image can't create sound, light, smell, or any other sensory effect. Physical interaction with the image reveals it to be an illusion, because things can pass through it.\n\nIf a creature uses its action to examine the sound or image, the creature can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the illusion becomes faint to the creature.",
      "duration": "1 minute",
      "level": 0,
      "materials": "a bit of fleece",
      "name": "Minor Illusion",
      "range": "30 ft.",
      "savingThrow": {
      },
      "school": "Illusion",
      "tags": [
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "canCastAtHigherLevel": true,
      "castingTime": "1 Action",
      "components": [
        "V"
      ],
      "damage": [
        {
          "dice": "1d4",
          "type": "Psychic"
        }
      ],
      "description": "You unleash a string of insults laced with subtle enchantments at a creature you can see within range. If the target can hear you (though it need not understand you), it must succeed on a Wisdom saving throw or take 1d4 psychic damage and have disadvantage on the next attack roll it makes before the end of its next turn.\n\nThis spell's damage increases by 1d4 when you reach 5th level (2d4), 11th level (3d4), and 17th level (4d4).",
      "duration": "Instantaneous",
      "higherLevelDescription": "This spell's damage increases by 1d4 when you reach 5th level (2d4), 11th level (3d4), and 17th level (4d4).",
      "higherLevels": [
        {
          "applyAtLevels": [
            5,
            11,
            17
          ],
          "damage": {
            "dice": "1d4",
            "type": "Psychic"
          },
          "type": "at-character-level"
        }
      ],
      "level": 0,
      "name": "Vicious Mockery",
      "range": "60 ft.",
      "savingThrow": {
        "abilityName": "wis"
      },
      "school": "Enchantment",
      "tags": [
        "Bard"
      ]
    }
  ],
  "textBlocks": [
    {
      "title": "Class Features"
    },
    {
      "title": "Racial Traits"
    },
    {
      "title": "Feats"
    },
    {
      "textBlocks": [
        {
        },
        {
        }
      ],
      "title": "Background"
    },
    {
      "textBlocks": [
        {
          "title": "Personality Traits"
        },
        {
          "title": "Ideals"
        },
        {
          "title": "Bonds"
        },
        {
          "title": "Flaws"
        }
      ],
      "title": "Characteristics"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Appearance"
    },
    {
      "title": "Organizations"
    },
    {
      "title": "Allies"
    },
    {
      "title": "Enemies"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Backstory"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Other"
    },
    {
      "textBlocks": [
        {
          "body": "The hag can breathe air and water.",
          "title": "Amphibious"
        },
        {
          "body": "The hag's innate spellcasting ability is Charisma (spell save DC 12). She can innately cast the following spells, requiring no material components:\n\nAt will: dancing lights, minor illusion, vicious mockery",
          "title": "Innate Spellcasting"
        },
        {
          "body": "The hag can mimic animal sounds and humanoid voices. A creature that hears the sounds can tell they are imitations with a successful DC 14 Wisdom (Insight) check.",
          "title": "Mimicry"
        },
        {
          "body": "The hag covers herself and anything she is wearing or carrying with a magical illusion that makes her look like another creature of her general size and humanoid shape. The illusion ends if the hag takes a bonus action to end it or if she dies.\n   The changes wrought by this effect fail to hold up to physical inspection. For example, the hag could appear to have smooth skin, but someone touching her would feel her rough flesh. Otherwise, a creature must take an action to visually inspect the illusion and succeed on a DC 20 Intelligence (Investigation) check to discern that the hag is disguised.",
          "title": "Illusionary Appearance"
        },
        {
          "body": "The hag magically turns invisible until she attacks or casts a spell, or until her concentration ends (as if concentrating on a spell). While invisible, she leaves no physical evidence of her passage, so she can be tracked only by magic. Any equipment she wears or carries is invisible with her.",
          "title": "Invisible Passage"
        },
        {
          "body": "The following lair actions are options for grandmothers and powerful aunties. Grandmothers usually have three to five lair actions, aunties usually only one (if they have any at all). Unless otherwise noted, any lair action that requires a creature to make a saving throw uses the save DC of the hag's most powerful ability.\n\nOn initiative count 20 (losing initiative ties), the hag can take a lair action to cause one of the following effects, but can't use the same effect two rounds in a row:\n\n* Until initiative count 20 on the next round, the hag can pass through solid walls, doors, ceilings, and floors as if the surfaces weren't there.\n\n* The hag targets any number of doors and windows that she can see, causing each one to either open or close as she wishes. Closed doors can be magically locked (requiring a successful DC 20 Strength check to force open) until she chooses to make them unlocked, or until she uses this lair action again to open them.\n\nA powerful green hag might have the following additional lair action:\n\n* The hag creates an illusory duplicate of herself, which appears in its own space. As long as she can see her duplicate, the hag can move it a distance equal to her walking speed as well as make the illusion speak on her turn (no action required). The illusion has the same statistics as the hag but can't take actions or reactions. It can interact with its environment and even pick up and hold real objects. The illusion seems real in every way but disappears if it takes any amount of damage. Otherwise, it lasts until the hag dismisses it (no action required) or can no longer see it. If the hag uses this lair action to create a new duplicate, the previous one vanishes, dropping any real objects in its possession.",
          "title": "Lair Actions"
        },
        {
          "body": "Each hag's lair is the source of three to five regional effects; the home of a grandmother, an auntie, or a coven has more effects than the lair of a single hag, including some that can directly harm intruders. Any regional effect that requires a creature to make a saving throw uses the save DC of the hag's most powerful ability. These effects either end immediately if the hag dies or abandons the lair, or take up to 2d10 days to fade away.\n\nThe region within 1 mile of a grandmother hag's lair is warped by the creature's fell magic, which creates one or more of the following effects:\n\n* Birds, rodents, snakes, spiders, or toads (or some other creatures appropriate to the hag) are found in great profusion.\n\n* Beasts that have an Intelligence score of 2 or lower are charmed by the hag and directed to be aggressive toward intruders in the area.\n\n* Strange carved figurines, twig fetishes, or rag dolls magically appear in trees.\n\nA powerful green hag creates one or more of the following additional regional effects within 1 mile of her lair:\n\n* Illusory duplicates of the hag appear in random places at random times (but never more than one in any given location). An illusory duplicate has no substance, but it looks, sounds, and moves like the hag. The hag can sense when one or more creatures are within 60 feet of her duplicate and can interact with them as if she were present and standing in the duplicate's space. If the illusory duplicate takes any damage, it disappears.\n\n* The region takes twice as long as normal to traverse, since the plants grow thick and twisted, and the swamps are thick with reeking mud.\n\n* Trees transform into awakened trees and attack when hostile intruders are near.",
          "title": "Regional Effects"
        },
        {
          "body": "When hags must work together, they form covens, in spite of their selfish natures. A coven is made up of hags of any type, all of whom are equals within the group. However, each of the hags continues to desire more personal power.\n   A coven consists of three hags so that any arguments between two hags can be settled by the third. If more than three hags ever come together, as might happen if two covens come into conflict, the result is usually chaos.\n\nShared Spellcasting (Coven Only). While all three members of a hag coven are within 30 feet of one another, they can each cast the following spells from the wizard's spell list but must share the spell slots among themselves:\n\n1st level (4 slots): identify, ray of sickness\n\n2nd level (3 slots): hold person, locate object\n\n3rd level (3 slots): bestow curse, counterspell, lightning bolt\n\n4th level (3 slots): phantasmal killer, polymorph\n\n5th level (2 slots): contact other plane, scrying\n\n6th level (1 slot): eyebite\n\nFor casting these spells, each hag is a 12th-level spellcaster that uses Intelligence as her spellcasting ability. The spell save DC is 12 + the hag's Intelligence modifier, and the spell attack bonus is 4 + the hag's Intelligence modifier.\n\nHag Eye. A hag coven can craft a magic item called a hag eye, which is made from a real eye coated in varnish and often fitted to a pendant or other wearable item. The hag eye is usually entrusted to a minion for safekeeping and transport. A hag in the coven can take an action to see what the hag eye sees if the hag eye is on the same plane of existence. A hag eye has AC 10, 1 hit point, and darkvision with a radius of 60 feet. If it is destroyed, each coven member takes 3d10 psychic damage and is blinded for 24 hours.\n   A hag coven can have only one hag eye at a time, and creating a new one requires all three members of the coven to perform a ritual. The ritual takes 1 hour, and the hags can't perform it while blinded. During the ritual, if the hags take any action other than performing the ritual, they must start over.",
          "title": "Hag Covens"
        }
      ],
      "title": "Abilities"
    }
  ],
  "type": "Fey"
}