{
  "abilityScores": [
    {
      "name": "str",
      "value": 18
    },
    {
      "name": "dex",
      "value": 15
    },
    {
      "name": "con",
      "value": 16
    },
    {
      "name": "int",
      "value": 18
    },
    {
      "name": "wis",
      "value": 18
    },
    {
      "name": "cha",
      "value": 18
    }
  ],
  "actions": [
    {
      "description": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) slashing damage",
      "name": "Claw",
      "sortOrder": 0,
      "steps": [
        {
          "attack": {
            "ability": "str",
            "crit": 20,
            "damageRolls": [
              {
                "abilityName": "str",
                "dice": "2d8",
                "type": "Slashing"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Claw",
            "rollsAttack": true
          },
          "type": "custom-attack"
        }
      ]
    }
  ],
  "alignment": "Lawful Neutral",
  "armorClass": 17,
  "armorType": "Natural Armor",
  "challengeRating": "11",
  "classes": [
    {
      "class": "Monster",
      "level": 1
    }
  ],
  "conditionImmunities": [
    "Charmed",
    "Frightened"
  ],
  "currentHp": 136,
  "damageImmunities": [
    {
      "damageType": "Psychic"
    }
  ],
  "damageResistances": [
    {
      "condition": "Nonmagical",
      "damageType": "Bludgeoning"
    },
    {
      "condition": "Nonmagical",
      "damageType": "Piercing"
    },
    {
      "condition": "Nonmagical",
      "damageType": "Slashing"
    }
  ],
  "exp": 7200,
  "hitDice": "16d10+48",
  "imageUri": "https://cdn.alchemyrpg.com/app-assets/monstrosity-token.svg",
  "initiativeBonus": 0,
  "isNPC": true,
  "isSpellcaster": true,
  "maxHp": 136,
  "movementModes": [
    {
      "distance": 40,
      "mode": "Walking"
    },
    {
      "distance": 60,
      "mode": "Fly"
    }
  ],
  "name": "Gynosphinx",
  "proficiencies": [
    {
      "name": "Common",
      "type": "language"
    },
    {
      "name": "Sphinx",
      "type": "language"
    }
  ],
  "proficiencyBonus": 4,
  "race": "NPC",
  "senses": [
    {
      "distance": 120,
      "name": "Truesight"
    }
  ],
  "size": "Large",
  "skills": [
    {
      "abilityName": "dex",
      "name": "Acrobatics",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Animal Handling",
      "proficient": false
    },
    {
      "abilityName": "int",
      "bonus": 4,
      "name": "Arcana",
      "proficient": true
    },
    {
      "abilityName": "str",
      "name": "Athletics",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Deception",
      "proficient": false
    },
    {
      "abilityName": "int",
      "bonus": 4,
      "name": "History",
      "proficient": true
    },
    {
      "abilityName": "wis",
      "name": "Insight",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Intimidation",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Investigation",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Medicine",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Nature",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Perception",
      "proficient": true
    },
    {
      "abilityName": "cha",
      "name": "Performance",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Persuasion",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Religion",
      "proficient": true
    },
    {
      "abilityName": "dex",
      "name": "Sleight of Hand",
      "proficient": false
    },
    {
      "abilityName": "dex",
      "name": "Stealth",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Survival",
      "proficient": false
    }
  ],
  "speed": 30,
  "spellFilters": [
    "Known"
  ],
  "spellSlots": [
    {
      "max": 4,
      "remaining": 4
    },
    {
      "max": 3,
      "remaining": 3
    },
    {
      "max": 3,
      "remaining": 3
    },
    {
      "max": 3,
      "remaining": 3
    },
    {
      "max": 1,
      "remaining": 1
    },
    {
      "max": 0,
      "remaining": 0
    },
    {
      "max": 0,
      "remaining": 0
    },
    {
      "max": 0,
      "remaining": 0
    },
    {
      "max": 0,
      "remaining": 0
    }
  ],
  "spellcastingAbility": "int",
  "spells": [
    {
      "castingTime": "1 Action",
      "components": [
        "V",
        "M"
      ],
      "description": "Magical darkness spreads from a point you choose within range to fill a 15-foot-radius sphere for the duration. The darkness spreads around corners. A creature with darkvision can't see through this darkness, and nonmagical light can't illuminate it.\n\nIf the point you choose is on an object you are holding or one that isn't being worn or carried, the darkness emanates from the object and moves with it. Completely covering the source of the darkness with an opaque object, such as a bowl or a helm, blocks the darkness.\n\nIf any of this spell's area overlaps with an area of light created by a spell of 2nd level or lower, the spell that created the light is dispelled.",
      "duration": "Up to 10 minutes",
      "level": 2,
      "materials": "bat fur and a drop of pitch or piece of coal",
      "name": "Darkness",
      "range": "60 ft.",
      "requiresConcentration": true,
      "savingThrow": {
      },
      "school": "Evocation",
      "tags": [
        "sorcerer",
        "warlock",
        "wizard"
      ]
    },
    {
      "castingTime": "1 Action",
      "components": [
        "V",
        "S"
      ],
      "description": "A spectral, floating hand appears at a point you choose within range. The hand lasts for the duration or until you dismiss it as an action. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again.\n\nYou can use your action to control the hand. You can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial. You can move the hand up to 30 feet each time you use it.\n\nThe hand can't attack, activate magic items, or carry more than 10 pounds.",
      "duration": "1 minute",
      "level": 0,
      "name": "Mage Hand",
      "range": "30 ft.",
      "school": "Conjuration",
      "tags": [
        "Artificer",
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "castingTime": "1 Action",
      "components": [
        "S",
        "M"
      ],
      "description": "You create a sound or an image of an object within range that lasts for the duration. The illusion also ends if you dismiss it as an action or cast this spell again.\n\nIf you create a sound, its volume can range from a whisper to a scream. It can be your voice, someone else's voice, a lion's roar, a beating of drums, or any other sound you choose. The sound continues unabated throughout the duration, or you can make discrete sounds at different times before the spell ends.\n\nIf you create an image of an object—such as a chair, muddy footprints, or a small chest—it must be no larger than a 5-foot cube. The image can't create sound, light, smell, or any other sensory effect. Physical interaction with the image reveals it to be an illusion, because things can pass through it.\n\nIf a creature uses its action to examine the sound or image, the creature can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the illusion becomes faint to the creature.",
      "duration": "1 minute",
      "level": 0,
      "materials": "a bit of fleece",
      "name": "Minor Illusion",
      "range": "30 ft.",
      "savingThrow": {
      },
      "school": "Illusion",
      "tags": [
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "castingTime": "1 Action",
      "components": [
        "V",
        "S"
      ],
      "description": "This spell is a minor magical trick that novice spellcasters use for practice. You create one of the following magical effects within range:\n\n*You create an instantaneous, harmless sensory effect, such as a shower of sparks, a puff of wind, faint musical notes, or an odd odor.\n\n*You instantaneously light or snuff out a candle, a torch, or a small campfire.\n\n*You instantaneously clean or soil an object no larger than 1 cubic foot.\n\n*You chill, warm, or flavor up to 1 cubic foot of nonliving material for 1 hour.\n\n*You make a color, a small mark, or a symbol appear on an object or a surface for 1 hour.\n\n*You create a nonmagical trinket or an illusory image that can fit in your hand and that lasts until the end of your next turn.\n\nIf you cast this spell multiple times, you can have up to three of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action.",
      "duration": "Up to 1 hour",
      "level": 0,
      "name": "Prestidigitation",
      "range": "10 ft.",
      "savingThrow": {
      },
      "school": "Transmutation",
      "tags": [
        "Artificer",
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "canBeCastAsRitual": true,
      "castingTime": "1 Action",
      "components": [
        "V",
        "S"
      ],
      "description": "For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any.\n\nThe spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.",
      "duration": "Up to 10 minutes ",
      "level": 1,
      "name": "Detect Magic",
      "range": "Self",
      "requiresConcentration": true,
      "savingThrow": {
      },
      "school": "Divination",
      "tags": [
        "Artificer",
        "Bard",
        "Cleric",
        "Druid",
        "Paladin",
        "Ranger",
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "canBeCastAsRitual": true,
      "castingTime": "1 minute",
      "components": [
        "V",
        "S",
        "M"
      ],
      "description": "You choose one object that you must touch throughout the casting of the spell. If it is a magic item or some other magic-imbued object, you learn its properties and how to use them, whether it requires attunement to use, and how many charges it has, if any. You learn whether any spells are affecting the item and what they are. If the item was created by a spell, you learn which spell created it.\n\nIf you instead touch a creature throughout the casting, you learn what spells, if any, are currently affecting it.",
      "duration": "Instantaneous",
      "level": 1,
      "materials": "a pearl worth at least 100 gp and an owl feather",
      "name": "Identify",
      "range": "Touch",
      "savingThrow": {
      },
      "school": "Divination",
      "tags": [
        "Artificer",
        "Bard",
        "Wizard"
      ]
    },
    {
      "castingTime": "1 Reaction",
      "components": [
        "V",
        "S"
      ],
      "description": "An invisible barrier of magical force appears and protects you. Until the start of your next turn, you have a +5 bonus to AC, including against the triggering attack, and you take no damage from magic missile.",
      "duration": "1 round",
      "level": 1,
      "name": "Shield",
      "range": "Self",
      "school": "Abjuration",
      "tags": [
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "castingTime": "1 Action",
      "components": [
        "V",
        "S"
      ],
      "description": "You or a creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target's person.",
      "duration": "Up to 1 minute",
      "level": 4,
      "name": "Greater Invisibility",
      "range": "Touch",
      "requiresConcentration": true,
      "savingThrow": {
      },
      "school": "Illusion",
      "tags": [
        "Bard",
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "castingTime": "1 Action",
      "components": [
        "V",
        "M"
      ],
      "description": "You suggest a course of activity (limited to a sentence or two) and magically influence a creature you can see within range that can hear and understand you. Creatures that can't be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act ends the spell.\n\nThe target must make a Wisdom saving throw. On a failed save, it pursues the course of action you described to the best of its ability. The suggested course of action can continue for the entire duration. If the suggested activity can be completed in a shorter time, the spell ends when the subject finishes what it was asked to do.\n\nYou can also specify conditions that will trigger a special activity during the duration. For example, you might suggest that a knight give her warhorse to the first beggar she meets. If the condition isn't met before the spell expires, the activity isn't performed.\n\nIf you or any of your companions damage the target, the spell ends.",
      "duration": "Up to 8 hours",
      "level": 2,
      "materials": "a snake's tongue and either a bit of honeycomb or a drop of sweet oil",
      "name": "Suggestion",
      "range": "30 ft.",
      "requiresConcentration": true,
      "savingThrow": {
        "abilityName": "wis"
      },
      "school": "Enchantment",
      "tags": [
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "canCastAtHigherLevel": true,
      "castingTime": "1 Action",
      "components": [
        "V",
        "S"
      ],
      "description": "Choose one creature, object, or magical effect within range. Any spell of 3rd level or lower on the target ends. For each spell of 4th level or higher on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a successful check, the spell ends.\n\nAt Higher Levels. When you cast this spell using a spell slot of 4th level or higher, you automatically end the effects of a spell on the target if the spell's level is equal to or less than the level of the spell slot you used.",
      "duration": "Instantaneous",
      "higherLevelDescription": "When you cast this spell using a spell slot of 4th level or higher, you automatically end the effects of a spell on the target if the spell's level is equal to or less than the level of the spell slot you used.",
      "level": 3,
      "name": "Dispel Magic",
      "range": "120 ft.",
      "savingThrow": {
      },
      "school": "Abjuration",
      "tags": [
        "Artificer",
        "Bard",
        "Cleric",
        "Druid",
        "Paladin",
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "castingTime": "1 Action",
      "components": [
        "V",
        "S",
        "M"
      ],
      "description": "Describe or name an object that is familiar to you. You sense the direction to the object's location, as long as that object is within 1,000 feet of you. If the object is in motion, you know the direction of its movement.\n\nThe spell can locate a specific object known to you, as long as you have seen it up close—within 30 feet—at least once. Alternatively, the spell can locate the nearest object of a particular kind, such as a certain kind of apparel, jewelry, furniture, tool, or weapon.\n\nThis spell can't locate an object if any thickness of lead, even a thin sheet, blocks a direct path between you and the object.",
      "duration": "Up to 10 minutes",
      "level": 2,
      "materials": "a forked twig",
      "name": "Locate Object",
      "range": "Self",
      "requiresConcentration": true,
      "school": "Divination",
      "tags": [
        "Bard",
        "Cleric",
        "Druid",
        "Paladin",
        "Ranger",
        "Wizard"
      ]
    },
    {
      "castingTime": "10 minutes",
      "components": [
        "V",
        "S",
        "M"
      ],
      "description": "Name or describe a person, place, or object. The spell brings to your mind a brief summary of the significant lore about the thing you named. The lore might consist of current tales, forgotten stories, or even secret lore that has never been widely known. If the thing you named isn't of legendary importance, you gain no information. The more information you already have about the thing, the more precise and detailed the information you receive is.\n\nThe information you learn is accurate but might be couched in figurative language. For example, if you have a mysterious magic axe on hand, the spell might yield this information: \"Woe to the evildoer whose hand touches the axe, for even the haft slices the hand of the evil ones. Only a true Child of Stone, lover and beloved of Moradin, may awaken the true powers of the axe, and only with the sacred word Rudnogg on the lips.\"",
      "duration": "Instantaneous",
      "level": 5,
      "materials": "incense worth at least 250 gp, which the spell consumes, and four ivory strips worth at least 50 gp each",
      "name": "Legend Lore",
      "range": "Self",
      "school": "Divination",
      "tags": [
        "Bard",
        "Cleric",
        "Wizard"
      ]
    },
    {
      "castingTime": "1 Action",
      "components": [
        "V",
        "S"
      ],
      "description": "At your touch, all curses affecting one creature or object end. If the object is a cursed magic item, its curse remains, but the spell breaks its owner's attunement to the object so it can be removed or discarded.",
      "duration": "Instantaneous",
      "level": 3,
      "name": "Remove Curse",
      "range": "Touch",
      "school": "Abjuration",
      "tags": [
        "Cleric",
        "Paladin",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "castingTime": "1 Action",
      "components": [
        "V",
        "M"
      ],
      "description": "This spell grants the creature you touch the ability to understand any spoken language it hears. Moreover, when the target speaks, any creature that knows at least one language and can hear the target understands what it says.",
      "duration": "1 hour",
      "level": 3,
      "materials": "a small clay model of ziggurat",
      "name": "Tongues",
      "range": "Touch",
      "school": "Divination",
      "tags": [
        "Bard",
        "Cleric",
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "canCastAtHigherLevel": true,
      "castingTime": "1 Action",
      "components": [
        "V",
        "S",
        "M"
      ],
      "description": "You attempt to send one creature that you can see within range to another plane of existence. The target must succeed on a Charisma saving throw or be banished.\n\nIf the target is native to the plane of existence you're on, you banish the target to a harmless demiplane. While there, the target is incapacitated. The target remains there until the spell ends, at which point the target reappears in the space it left or in the nearest unoccupied space if that space is occupied.\n\nIf the target is native to a different plane of existence than the one you're on, the target is banished with a faint popping noise, returning to its home plane. If the spell ends before 1 minute has passed, the target reappears in the space it left or in the nearest unoccupied space if that space is occupied. Otherwise, the target doesn't return.\n\nAt Higher Levels. When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th.",
      "duration": "Up to 1 minute",
      "higherLevelDescription": "When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th.",
      "level": 4,
      "materials": "an item distasteful to the target",
      "name": "Banishment",
      "range": "60 ft.",
      "requiresConcentration": true,
      "savingThrow": {
        "abilityName": "cha"
      },
      "school": "Abjuration",
      "tags": [
        "Cleric",
        "Paladin",
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    }
  ],
  "textBlocks": [
    {
      "title": "Class Features"
    },
    {
      "title": "Racial Traits"
    },
    {
      "title": "Feats"
    },
    {
      "textBlocks": [
        {
        },
        {
        }
      ],
      "title": "Background"
    },
    {
      "textBlocks": [
        {
          "title": "Personality Traits"
        },
        {
          "title": "Ideals"
        },
        {
          "title": "Bonds"
        },
        {
          "title": "Flaws"
        }
      ],
      "title": "Characteristics"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Appearance"
    },
    {
      "title": "Organizations"
    },
    {
      "title": "Allies"
    },
    {
      "title": "Enemies"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Backstory"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Other"
    },
    {
      "textBlocks": [
        {
          "body": "The sphinx is immune to any effect that would sense its emotions or read its thoughts, as well as any divination spell that it refuses. Wisdom (Insight) checks made to ascertain the sphinx's intentions or sincerity have disadvantage.",
          "title": "Inscrutable"
        },
        {
          "body": "The sphinx's weapon attacks are magical.",
          "title": "Magic Weapons"
        },
        {
          "body": "The sphinx is a 9th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 16, +8 to hit with spell attacks). It requires no material components to cast its spells. The sphinx has the following wizard spells prepared:\n\nCantrips (at will): mage hand, minor illusion, prestidigitation\n\n1st level (4 slots): detect magic, identify, shield\n\n2nd level (3 slots): darkness, locate object, suggestion\n\n3rd level (3 slots): dispel magic, remove curse, tongues\n\n4th level (3 slots): banishment, greater invisibility\n\n5th level (1 slot): legend lore\n",
          "title": "Spellcasting"
        },
        {
          "body": "The sphinx makes two claw attacks.",
          "title": "Multiattack"
        },
        {
          "body": "The gynosphinx can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The gynosphinx regains spent legendary actions at the start of its turn.\n\nClaw Attack. The sphinx makes one claw attack.\n\nTeleport (Costs 2 Actions). The sphinx magically teleports, along with any equipment it is wearing or carrying, up to 120 feet to an unoccupied space it can see.\n\nCast a Spell (Costs 3 Actions). The sphinx casts a spell from its list of prepared spells, using a spell slot as normal.",
          "title": "Legendary Actions"
        },
        {
          "body": "On initiative count 20 (losing initiative ties), the sphinx can take a lair action to cause one of the following magical effects; the sphinx can't use an effect again until it finishes a short or long rest:\n\n* The flow of time is altered such that every creature in the lair must reroll initiative. The sphinx can choose not to reroll.\n\n* The effects of time are altered such that every creature in the lair must succeed on a DC 15 Constitution saving throw or become 1d20 years older or younger (the sphinx's choice), but never any younger than 1 year old. A greater restoration spell can restore a creature's age to normal.\n\n* The flow of time within the lair is altered such that everything within moves up to 10 years forward or backward (sphinx's choice). Only the sphinx is immediately aware of the time change. A wish spell can return the caster and up to seven other creatures designated by the caster to their normal time.\n\n* The sphinx shifts itself and up to seven other creatures it can see within in its lair to another plane of existence. Once outside its lair, the sphinx can't use lair actions, but it can return to its lair as a bonus action on its turn, taking up to seven creatures with it.",
          "title": "Lair Actions"
        }
      ],
      "title": "Abilities"
    }
  ],
  "type": "Monstrosity"
}