{
  "abilityScores": [
    {
      "name": "str",
      "value": 18
    },
    {
      "name": "dex",
      "value": 15
    },
    {
      "name": "con",
      "value": 16
    },
    {
      "name": "int",
      "value": 16
    },
    {
      "name": "wis",
      "value": 14
    },
    {
      "name": "cha",
      "value": 16
    }
  ],
  "actions": [
    {
      "description": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) slashing damage.",
      "name": "Claws (Hag Form Only)",
      "sortOrder": 0,
      "steps": [
        {
          "attack": {
            "ability": "str",
            "crit": 20,
            "damageRolls": [
              {
                "abilityName": "str",
                "dice": "2d8",
                "type": "Slashing"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Claws (Hag Form Only)",
            "rollsAttack": true,
            "savingThrow": {
            }
          },
          "journalCommand": {
          },
          "skillCheck": {
          },
          "type": "custom-attack"
        }
      ]
    }
  ],
  "alignment": "Neutral Evil",
  "armorClass": 17,
  "armorType": "Natural Armor",
  "challengeRating": "5",
  "classes": [
    {
      "class": "Monster",
      "level": 1
    }
  ],
  "conditionImmunities": [
    "Charmed"
  ],
  "currentHp": 112,
  "damageResistances": [
    {
      "damageType": "Cold"
    },
    {
      "damageType": "Fire"
    },
    {
      "condition": "Nonmagical (excludes silvered)",
      "damageType": "Bludgeoning"
    },
    {
      "condition": "Nonmagical (excludes silvered)",
      "damageType": "Piercing"
    },
    {
      "condition": "Nonmagical (excludes silvered)",
      "damageType": "Slashing"
    }
  ],
  "exp": 1800,
  "hitDice": "15d8+45",
  "imageUri": "https://cdn.alchemyrpg.com/app-assets/fiend-token.svg",
  "initiativeBonus": 0,
  "isNPC": true,
  "isSpellcaster": true,
  "maxHp": 112,
  "movementModes": [
    {
      "distance": 30,
      "mode": "Walking"
    }
  ],
  "name": "Night Hag",
  "proficiencies": [
    {
      "name": "Abyssal",
      "type": "language"
    },
    {
      "name": "Common",
      "type": "language"
    },
    {
      "name": "Infernal",
      "type": "language"
    },
    {
      "name": "Primordial",
      "type": "language"
    }
  ],
  "proficiencyBonus": 3,
  "race": "NPC",
  "senses": [
    {
      "distance": 120,
      "name": "Darkvision"
    }
  ],
  "size": "Medium",
  "skills": [
    {
      "abilityName": "dex",
      "name": "Acrobatics",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Animal Handling",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Arcana",
      "proficient": false
    },
    {
      "abilityName": "str",
      "name": "Athletics",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Deception",
      "proficient": true
    },
    {
      "abilityName": "int",
      "name": "History",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Insight",
      "proficient": true
    },
    {
      "abilityName": "cha",
      "name": "Intimidation",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Investigation",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Medicine",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Nature",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Perception",
      "proficient": true
    },
    {
      "abilityName": "cha",
      "name": "Performance",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Persuasion",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Religion",
      "proficient": false
    },
    {
      "abilityName": "dex",
      "name": "Sleight of Hand",
      "proficient": false
    },
    {
      "abilityName": "dex",
      "name": "Stealth",
      "proficient": true
    },
    {
      "abilityName": "wis",
      "name": "Survival",
      "proficient": false
    }
  ],
  "speed": 30,
  "spellFilters": [
    "Known"
  ],
  "spellSlots": [
    {
      "max": 0,
      "remaining": 0
    },
    {
      "max": 0,
      "remaining": 0
    },
    {
      "max": 0,
      "remaining": 0
    },
    {
      "max": 0,
      "remaining": 0
    },
    {
      "max": 0,
      "remaining": 0
    },
    {
      "max": 0,
      "remaining": 0
    },
    {
      "max": 0,
      "remaining": 0
    },
    {
      "max": 0,
      "remaining": 0
    },
    {
      "max": 0,
      "remaining": 0
    }
  ],
  "spellcastingAbility": "cha",
  "spells": [
    {
      "canCastAtHigherLevel": true,
      "castingTime": "1 Action",
      "components": [
        "V",
        "S"
      ],
      "damage": [
        {
          "bonus": 1,
          "dice": "1d4",
          "type": "Force"
        },
        {
          "bonus": 1,
          "dice": "1d4",
          "type": "Force"
        },
        {
          "bonus": 1,
          "dice": "1d4",
          "type": "Force"
        }
      ],
      "description": "You create three glowing darts of magical force. Each dart hits a creature of your choice that you can see within range. A dart deals 1d4 + 1 force damage to its target. The darts all strike simultaneously, and you can direct them to hit one creature or several.\n\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the spell creates one more dart for each slot level above 1st.",
      "duration": "Instantaneous",
      "higherLevelDescription": "When you cast this spell using a spell slot of 2nd level or higher, the spell creates one more dart for each slot level above 1st.",
      "higherLevels": [
        {
          "applyAtLevels": [
            2
          ],
          "damage": {
            "bonus": 1,
            "dice": "1d4",
            "type": "Force"
          },
          "type": "per-slot"
        }
      ],
      "level": 1,
      "name": "Magic Missile",
      "range": "120 ft.",
      "rollsAttack": false,
      "savingThrow": {
      },
      "school": "Evocation",
      "tags": [
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "canBeCastAsRitual": true,
      "castingTime": "1 Action",
      "components": [
        "V",
        "S"
      ],
      "description": "For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any.\n\nThe spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.",
      "duration": "Up to 10 minutes ",
      "level": 1,
      "name": "Detect Magic",
      "range": "Self",
      "requiresConcentration": true,
      "savingThrow": {
      },
      "school": "Divination",
      "tags": [
        "Artificer",
        "Bard",
        "Cleric",
        "Druid",
        "Paladin",
        "Ranger",
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "canCastAtHigherLevel": true,
      "castingTime": "1 Action",
      "components": [
        "V",
        "S",
        "M"
      ],
      "description": "This spell sends creatures into a magical slumber. Roll 5d8; the total is how many hit points of creatures this spell can affect. Creatures within 20 feet of a point you choose within range are affected in ascending order of their current hit points (ignoring unconscious creatures).\n\nStarting with the creature that has the lowest current hit points, each creature affected by this spell falls unconscious until the spell ends, the sleeper takes damage, or someone uses an action to shake or slap the sleeper awake. Subtract each creature's hit points from the total before moving on to the creature with the next lowest hit points. A creature's hit points must be equal to or less than the remaining total for that creature to be affected.\n\nUndead and creatures immune to being charmed aren't affected by this spell.\n\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, roll an additional 2d8 for each slot level above 1st.",
      "duration": "1 minute",
      "higherLevelDescription": "When you cast this spell using a spell slot of 2nd level or higher, roll an additional 2d8 for each slot level above 1st.",
      "level": 1,
      "materials": "a pinch of find sand, rose petals, or a cricket",
      "name": "Sleep",
      "range": "90 ft.",
      "rollsAttack": false,
      "savingThrow": {
      },
      "school": "Enchantment",
      "tags": [
        "Bard",
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "castingTime": "1 Action",
      "components": [
        "V",
        "S"
      ],
      "description": "A black beam of enervating energy springs from your finger toward a creature within range. Make a ranged spell attack against the target. On a hit, the target deals only half damage with weapon attacks that use Strength until the spell ends.\n\nAt the end of each of the target's turns, it can make a Constitution saving throw against the spell. On a success, the spell ends.",
      "duration": "Up to 1 minute",
      "level": 2,
      "name": "Ray of Enfeeblement",
      "range": "60 ft.",
      "requiresConcentration": true,
      "rollsAttack": true,
      "savingThrow": {
        "abilityName": "CON"
      },
      "school": "Necromancy",
      "tags": [
        "Warlock",
        "Wizard"
      ]
    },
    {
      "castingTime": "1 Action",
      "components": [
        "V",
        "S",
        "M"
      ],
      "description": "You and up to eight willing creatures who link hands in a circle are transported to a different plane of existence. You can specify a target destination in general terms, such as the City of Brass on the Elemental Plane of Fire or the palace of Dispater on the second level of the Nine Hells, and you appear in or near that destination. If you are trying to reach the City of Brass, for example, you might arrive in its Street of Steel, before its Gate of Ashes, or looking at the city from across the Sea of Fire, at the DM's discretion.\n\nAlternatively, if you know the sigil sequence of a teleportation circle on another plane of existence, this spell can take you to that circle. If the teleportation circle is too small to hold all the creatures you transported, they appear in the closest unoccupied spaces next to the circle.\n\nYou can use this spell to banish an unwilling creature to another plane. Choose a creature within your reach and make a melee spell attack against it. On a hit, the creature must make a Charisma saving throw. If the creature fails this save, it is transported to a random location on the plane of existence you specify. A creature so transported must find its own way back to your current plane of existence.",
      "duration": "Instantaneous",
      "level": 7,
      "materials": "a forked, metal rod worth at least 250 gp, attuned to a particular plane of existence",
      "name": "Plane Shift",
      "range": "Touch",
      "rollsAttack": false,
      "savingThrow": {
      },
      "school": "Conjuration",
      "tags": [
        "Cleric",
        "Druid",
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    }
  ],
  "textBlocks": [
    {
      "title": "Class Features"
    },
    {
      "title": "Racial Traits"
    },
    {
      "title": "Feats"
    },
    {
      "textBlocks": [
        {
        },
        {
        }
      ],
      "title": "Background"
    },
    {
      "textBlocks": [
        {
          "title": "Personality Traits"
        },
        {
          "title": "Ideals"
        },
        {
          "title": "Bonds"
        },
        {
          "title": "Flaws"
        }
      ],
      "title": "Characteristics"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Appearance"
    },
    {
      "title": "Organizations"
    },
    {
      "title": "Allies"
    },
    {
      "title": "Enemies"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Backstory"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Other"
    },
    {
      "textBlocks": [
        {
          "body": "The hag's innate spellcasting ability is Charisma (spell save DC 14, +6 to hit with spell attacks). She can innately cast the following spells, requiring no material components:\n\nAt will: detect magic, magic missile\n\n2/day each: plane shift (self only), ray of enfeeblement, sleep",
          "title": "Innate Spellcasting"
        },
        {
          "body": "The hag has advantage on saving throws against spells and other magical effects.",
          "title": "Magic Resistance"
        },
        {
          "body": "A night hag carries two very rare magic items that she must craft for herself. If either object is lost, the night hag will go to great lengths to retrieve it, as creating a new tool takes time and effort.\n   Heartstone: This lustrous black gem allows a night hag to become ethereal while it is in her possession. The touch of a heartstone also cures any disease. Crafting a heartstone takes 30 days.\n   Soul Bag: When an evil humanoid dies as a result of a night hag's Nightmare Haunting, the hag catches the soul in this black sack made of stitched flesh. A soul bag can hold only one evil soul at a time, and only the night hag who crafted the bag can catch a soul with it. Crafting a soul bag takes 7 days and a humanoid sacrifice (whose flesh is used to make the bag).",
          "title": "Night Hag Items"
        },
        {
          "body": "The hag magically polymorphs into a Small or Medium female humanoid, or back into her true form. Her statistics are the same in each form. Any equipment she is wearing or carrying isn't transformed. She reverts to her true form if she dies.",
          "title": "Change Shape"
        },
        {
          "body": "The hag magically enters the Ethereal Plane from the Material Plane, or vice versa. To do so, the hag must have a heartstone in her possession.",
          "title": "Etherealness"
        },
        {
          "body": "While on the Ethereal Plane, the hag magically touches a sleeping humanoid on the Material Plane. A protection from evil and good spell cast on the target prevents this contact, as does a magic circle. As long as the contact persists, the target has dreadful visions. If these visions last for at least 1 hour, the target gains no benefit from its rest, and its hit point maximum is reduced by 5 (1d10). If this effect reduces the target's hit point maximum to 0, the target dies, and if the target was evil, its soul is trapped in the hag's soul bag. The reduction to the target's hit point maximum lasts until removed by the greater restoration spell or similar magic.",
          "title": "Nightmare Haunting (1/Day)"
        },
        {
          "body": "The following lair actions are options for grandmothers and powerful aunties. Grandmothers usually have three to five lair actions, aunties usually only one (if they have any at all). Unless otherwise noted, any lair action that requires a creature to make a saving throw uses the save DC of the hag's most powerful ability.\n\nOn initiative count 20 (losing initiative ties), the hag can take a lair action to cause one of the following effects, but can't use the same effect two rounds in a row:\n\n* Until initiative count 20 on the next round, the hag can pass through solid walls, doors, ceilings, and floors as if the surfaces weren't there.\n\n* The hag targets any number of doors and windows that she can see, causing each one to either open or close as she wishes. Closed doors can be magically locked (requiring a successful DC 20 Strength check to force open) until she chooses to make them unlocked, or until she uses this lair action again to open them.\n\nA powerful night hag might have the following additional lair actions:\n\n* One creature the hag can see within 120 feet of her must succeed on a DC 15 Charisma saving throw or be banished to a prison demiplane. To escape, the creature must use its action to make a Charisma check contested by the hag's. If the creature wins, it escapes the demiplane. Otherwise, the effect ends on initiative count 20 on the next round. When the effect ends, the creature reappears in the space it left or in the nearest unoccupied space if that one is occupied.\n\n* The hag targets up to three creatures that she can see within 60 feet of her. Each target must succeed on a DC 15 Constitution saving throw or be flung up to 30 feet through the air. A creature that strikes a solid object or is released in midair takes 1d6 bludgeoning damage for every 10 feet moved or fallen",
          "title": "Lair Actions"
        },
        {
          "body": "Each hag's lair is the source of three to five regional effects; the home of a grandmother, an auntie, or a coven has more effects than the lair of a single hag, including some that can directly harm intruders. Any regional effect that requires a creature to make a saving throw uses the save DC of the hag's most powerful ability. These effects either end immediately if the hag dies or abandons the lair, or take up to 2d10 days to fade away.\n\nThe region within 1 mile of a grandmother hag's lair is warped by the creature's fell magic, which creates one or more of the following effects:\n\n* Birds, rodents, snakes, spiders, or toads (or some other creatures appropriate to the hag) are found in great profusion.\n\n* Beasts that have an Intelligence score of 2 or lower are charmed by the hag and directed to be aggressive toward intruders in the area.\n\n* Strange carved figurines, twig fetishes, or rag dolls magically appear in trees.\n\nA powerful night hag creates one or more of the following additional regional effects within 1 mile of her lair:\n\n* Shadows seem abnormally gaunt and sometimes move on their own as though alive.\n\n* Creatures are transported to a harmless but eerie demiplane filled with shadowy forms, waxy corpses, and cackling. The creatures are trapped there for a minute or two, and then returned to the place where they vanished from.\n\n* Intelligent creatures see hallucinations of dead friends, family members, and even themselves littering the hag's realm. Any attempt to interact with a hallucinatory image causes it to disappear.\n",
          "title": "Regional Effects"
        },
        {
          "body": "When hags must work together, they form covens, in spite of their selfish natures. A coven is made up of hags of any type, all of whom are equals within the group. However, each of the hags continues to desire more personal power.\n\nA coven consists of three hags so that any arguments between two hags can be settled by the third. If more than three hags ever come together, as might happen if two covens come into conflict, the result is usually chaos.\n\nShared Spellcasting (Coven Only). While all three members of a hag coven are within 30 feet of one another, they can each cast the following spells from the wizard's spell list but must share the spell slots among themselves:\n\n1st level (4 slots): identify, ray of sickness\n\n2nd level (3 slots): hold person, locate object\n\n3rd level (3 slots): bestow curse, counterspell, lightning bolt\n\n4th level (3 slots): phantasmal killer, polymorph\n\n5th level (2 slots): contact other plane, scrying\n\n6th level (1 slot): eyebite\n\nFor casting these spells, each hag is a 12th-level spellcaster that uses Intelligence as her spellcasting ability. The spell save DC is 12 + the hag's Intelligence modifier, and the spell attack bonus is 4 + the hag's Intelligence modifier.\n\nHag Eye. A hag coven can craft a magic item called a hag eye, which is made from a real eye coated in varnish and often fitted to a pendant or other wearable item. The hag eye is usually entrusted to a minion for safekeeping and transport. A hag in the coven can take an action to see what the hag eye sees if the hag eye is on the same plane of existence. A hag eye has AC 10, 1 hit point, and darkvision with a radius of 60 feet. If it is destroyed, each coven member takes 3d10 psychic damage and is blinded for 24 hours.\n   A hag coven can have only one hag eye at a time, and creating a new one requires all three members of the coven to perform a ritual. The ritual takes 1 hour, and the hags can't perform it while blinded. During the ritual, if the hags take any action other than performing the ritual, they must start over.",
          "title": "Hag Covens"
        }
      ],
      "title": "Abilities"
    }
  ],
  "type": "Fiend"
}