{
  "abilityScores": [
    {
      "name": "str",
      "value": 14
    },
    {
      "name": "dex",
      "value": 17
    },
    {
      "name": "con",
      "value": 18
    },
    {
      "name": "int",
      "value": 13
    },
    {
      "name": "wis",
      "value": 16
    },
    {
      "name": "cha",
      "value": 20
    }
  ],
  "actions": [
    {
      "description": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 9 (2d6 + 2) slashing damage, and the target is cursed if it is a creature. The magical curse takes effect whenever the target takes a short or long rest, filling the target's thoughts with horrible images and dreams. The cursed target gains no benefit from finishing a short or long rest. The curse lasts until it is lifted by a remove curse spell or similar magic.",
      "name": "Claw",
      "sortOrder": 0,
      "steps": [
        {
          "attack": {
            "ability": "str",
            "crit": 20,
            "damageRolls": [
              {
                "abilityName": "str",
                "dice": "2d6",
                "type": "Slashing"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Claw",
            "rollsAttack": true
          },
          "type": "custom-attack"
        }
      ]
    }
  ],
  "alignment": "Lawful Evil",
  "armorClass": 16,
  "armorType": "Natural Armor",
  "challengeRating": "13",
  "classes": [
    {
      "class": "Monster",
      "level": 1
    }
  ],
  "currentHp": 110,
  "damageImmunities": [
    {
      "condition": "Nonmagical",
      "damageType": "Bludgeoning"
    },
    {
      "condition": "Nonmagical",
      "damageType": "Piercing"
    },
    {
      "condition": "Nonmagical",
      "damageType": "Slashing"
    }
  ],
  "damageVulnerabilities": [
    {
      "condition": "Magic weapons wielded by good creatures",
      "damageType": "Piercing"
    }
  ],
  "exp": 10000,
  "hitDice": "13d8+52",
  "imageUri": "https://cdn.alchemyrpg.com/app-assets/fiend-token.svg",
  "initiativeBonus": 0,
  "isNPC": true,
  "isSpellcaster": true,
  "maxHp": 110,
  "movementModes": [
    {
      "distance": 40,
      "mode": "Walking"
    }
  ],
  "name": "Rakshasa",
  "proficiencies": [
    {
      "name": "Common",
      "type": "language"
    },
    {
      "name": "Infernal",
      "type": "language"
    }
  ],
  "proficiencyBonus": 5,
  "race": "NPC",
  "senses": [
    {
      "distance": 60,
      "name": "Darkvision"
    }
  ],
  "size": "Medium",
  "skills": [
    {
      "abilityName": "dex",
      "name": "Acrobatics",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Animal Handling",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Arcana",
      "proficient": false
    },
    {
      "abilityName": "str",
      "name": "Athletics",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Deception",
      "proficient": true
    },
    {
      "abilityName": "int",
      "name": "History",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Insight",
      "proficient": true
    },
    {
      "abilityName": "cha",
      "name": "Intimidation",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Investigation",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Medicine",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Nature",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Perception",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Performance",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Persuasion",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Religion",
      "proficient": false
    },
    {
      "abilityName": "dex",
      "name": "Sleight of Hand",
      "proficient": false
    },
    {
      "abilityName": "dex",
      "name": "Stealth",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Survival",
      "proficient": false
    }
  ],
  "speed": 30,
  "spellFilters": [
    "Known"
  ],
  "spellSlots": [
    {
      "max": 0,
      "remaining": 0
    },
    {
      "max": 0,
      "remaining": 0
    },
    {
      "max": 0,
      "remaining": 0
    },
    {
      "max": 0,
      "remaining": 0
    },
    {
      "max": 0,
      "remaining": 0
    },
    {
      "max": 0,
      "remaining": 0
    },
    {
      "max": 0,
      "remaining": 0
    },
    {
      "max": 0,
      "remaining": 0
    },
    {
      "max": 0,
      "remaining": 0
    }
  ],
  "spellcastingAbility": "cha",
  "spells": [
    {
      "castingTime": "1 Action",
      "components": [
        "V",
        "S",
        "M"
      ],
      "description": "For the duration, you can read the thoughts of certain creatures. When you cast the spell and as your action on each turn until the spell ends, you can focus your mind on any one creature that you can see within 30 feet of you. If the creature you choose has an Intelligence of 3 or lower or doesn't speak any language, the creature is unaffected.\n\nYou initially learn the surface thoughts of the creature—what is most on its mind in that moment. As an action, you can either shift your attention to another creature's thoughts or attempt to probe deeper into the same creature's mind. If you probe deeper, the target must make a Wisdom saving throw. If it fails, you gain insight into its reasoning (if any), its emotional state, and something that looms large in its mind (such as something it worries over, loves, or hates). If it succeeds, the spell ends. Either way, the target knows that you are probing into its mind, and unless you shift your attention to another creature's thoughts, the creature can use its action on its turn to make an Intelligence check contested by your Intelligence check; if it succeeds, the spell ends.\n\nQuestions verbally directed at the target creature naturally shape the course of its thoughts, so this spell is particularly effective as part of an interrogation.\n\nYou can also use this spell to detect the presence of thinking creatures you can't see. When you cast the spell or as your action during the duration, you can search for thoughts within 30 feet of you. The spell can penetrate barriers, but 2 feet of rock, 2 inches of any metal other than lead, or a thin sheet of lead blocks you. You can't detect a creature with an Intelligence of 3 or lower or one that doesn't speak any language.\n\nOnce you detect the presence of a creature in this way, you can read its thoughts for the rest of the duration as described above, even if you can't see it, but it must still be within range.",
      "duration": "Up to 1 minute",
      "level": 2,
      "materials": "a copper piece",
      "name": "Detect Thoughts",
      "range": "Self",
      "requiresConcentration": true,
      "savingThrow": {
        "abilityName": "wis"
      },
      "school": "Divination",
      "tags": [
        "bard",
        "sorcerer",
        "wizard"
      ]
    },
    {
      "castingTime": "1 Action",
      "components": [
        "V",
        "S"
      ],
      "description": "A spectral, floating hand appears at a point you choose within range. The hand lasts for the duration or until you dismiss it as an action. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again.\n\nYou can use your action to control the hand. You can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial. You can move the hand up to 30 feet each time you use it.\n\nThe hand can't attack, activate magic items, or carry more than 10 pounds.",
      "duration": "1 minute",
      "level": 0,
      "name": "Mage Hand",
      "range": "30 ft.",
      "school": "Conjuration",
      "tags": [
        "Artificer",
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "castingTime": "1 Action",
      "components": [
        "S",
        "M"
      ],
      "description": "You create a sound or an image of an object within range that lasts for the duration. The illusion also ends if you dismiss it as an action or cast this spell again.\n\nIf you create a sound, its volume can range from a whisper to a scream. It can be your voice, someone else's voice, a lion's roar, a beating of drums, or any other sound you choose. The sound continues unabated throughout the duration, or you can make discrete sounds at different times before the spell ends.\n\nIf you create an image of an object—such as a chair, muddy footprints, or a small chest—it must be no larger than a 5-foot cube. The image can't create sound, light, smell, or any other sensory effect. Physical interaction with the image reveals it to be an illusion, because things can pass through it.\n\nIf a creature uses its action to examine the sound or image, the creature can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the illusion becomes faint to the creature.",
      "duration": "1 minute",
      "level": 0,
      "materials": "a bit of fleece",
      "name": "Minor Illusion",
      "range": "30 ft.",
      "savingThrow": {
      },
      "school": "Illusion",
      "tags": [
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "canBeCastAsRitual": true,
      "castingTime": "1 Action",
      "components": [
        "V",
        "S"
      ],
      "description": "For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any.\n\nThe spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.",
      "duration": "Up to 10 minutes ",
      "level": 1,
      "name": "Detect Magic",
      "range": "Self",
      "requiresConcentration": true,
      "savingThrow": {
      },
      "school": "Divination",
      "tags": [
        "Artificer",
        "Bard",
        "Cleric",
        "Druid",
        "Paladin",
        "Ranger",
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "canCastAtHigherLevel": true,
      "castingTime": "1 Action",
      "components": [
        "V",
        "S"
      ],
      "description": "You attempt to charm a humanoid you can see within range. It must make a Wisdom saving throw, and does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. The charmed creature regards you as a friendly acquaintance. When the spell ends, the creature knows it was charmed by you.\n\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them.",
      "duration": "1 hour",
      "higherLevelDescription": "When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them.",
      "level": 1,
      "name": "Charm Person",
      "range": "30 ft.",
      "savingThrow": {
        "abilityName": "wis"
      },
      "school": "Enchantment",
      "tags": [
        "Bard",
        "Druid",
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "castingTime": "1 Action",
      "components": [
        "V",
        "S"
      ],
      "description": "You make yourself—including your clothing, armor, weapons, and other belongings on your person—look different until the spell ends or until you use your action to dismiss it. You can seem 1 foot shorter or taller and can appear thin, fat, or in between. You can't change your body type, so you must adopt a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you.\n\nThe changes wrought by this spell fail to hold up to physical inspection. For example, if you use this spell to add a hat to your outfit, objects pass through the hat, and anyone who touches it would feel nothing or would feel your head and hair. If you use this spell to appear thinner than you are, the hand of someone who reaches out to touch you would bump into you while it was seemingly still in midair.\n\nTo discern that you are disguised, a creature can use its action to inspect your appearance and must succeed on an Intelligence (Investigation) check against your spell save DC.",
      "duration": "1 hour",
      "level": 1,
      "name": "Disguise Self",
      "range": "Self",
      "savingThrow": {
      },
      "school": "Illusion",
      "tags": [
        "Artificer",
        "Bard",
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "castingTime": "1 Action",
      "components": [
        "V",
        "M"
      ],
      "description": "You suggest a course of activity (limited to a sentence or two) and magically influence a creature you can see within range that can hear and understand you. Creatures that can't be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act ends the spell.\n\nThe target must make a Wisdom saving throw. On a failed save, it pursues the course of action you described to the best of its ability. The suggested course of action can continue for the entire duration. If the suggested activity can be completed in a shorter time, the spell ends when the subject finishes what it was asked to do.\n\nYou can also specify conditions that will trigger a special activity during the duration. For example, you might suggest that a knight give her warhorse to the first beggar she meets. If the condition isn't met before the spell expires, the activity isn't performed.\n\nIf you or any of your companions damage the target, the spell ends.",
      "duration": "Up to 8 hours",
      "level": 2,
      "materials": "a snake's tongue and either a bit of honeycomb or a drop of sweet oil",
      "name": "Suggestion",
      "range": "30 ft.",
      "requiresConcentration": true,
      "savingThrow": {
        "abilityName": "wis"
      },
      "school": "Enchantment",
      "tags": [
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "canCastAtHigherLevel": true,
      "castingTime": "1 Action",
      "components": [
        "V",
        "S",
        "M"
      ],
      "description": "You touch a willing creature. The target gains a flying speed of 60 feet for the duration. When the spell ends, the target falls if it is still aloft, unless it can stop the fall.\n\nAt Higher Levels. When you cast this spell using a spell slot of 4th level or higher, you can target one additional creature for each slot level above 3rd.",
      "duration": "Up to 10 minutes",
      "higherLevelDescription": "When you cast this spell using a spell slot of 4th level or higher, you can target one additional creature for each slot level above 3rd.",
      "level": 3,
      "materials": "a wing feather from any bird",
      "name": "Fly",
      "range": "Touch",
      "requiresConcentration": true,
      "savingThrow": {
      },
      "school": "Transmutation",
      "tags": [
        "Artificer",
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "canCastAtHigherLevel": true,
      "castingTime": "1 Action",
      "components": [
        "V",
        "S",
        "M"
      ],
      "description": "A creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target's person. The spell ends for a target that attacks or casts a spell.\n\nAt Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.",
      "duration": "Up to 1 hour",
      "higherLevelDescription": "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.",
      "level": 2,
      "materials": "an eyelash encased in gum arabic",
      "name": "Invisibility",
      "range": "Touch",
      "requiresConcentration": true,
      "school": "Illusion",
      "tags": [
        "Artificer",
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "canCastAtHigherLevel": true,
      "castingTime": "1 Action",
      "components": [
        "V",
        "S",
        "M"
      ],
      "description": "You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 20-foot cube. The image appears at a spot that you can see within range and lasts for the duration. It seems completely real, including sounds, smells, and temperature appropriate to the thing depicted. You can't create sufficient heat or cold to cause damage, a sound loud enough to deal thunder damage or deafen a creature, or a smell that might sicken a creature (like a troglodyte's stench).\n\nAs long as you are within range of the illusion, you can use your action to cause the image to move to any other spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking. Similarly, you can cause the illusion to make different sounds at different times, even making it carry on a conversation, for example.\n\nPhysical interaction with the image reveals it to be an illusion, because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image, and its other sensory qualities become faint to the creature.\n\nAt Higher Levels. When you cast this spell using a spell slot of 6th level or higher, the spell lasts until dispelled, without requiring your concentration.",
      "duration": "Up to 10 minutes",
      "higherLevelDescription": "When you cast this spell using a spell slot of 6th level or higher, the spell lasts until dispelled, without requiring your concentration.",
      "level": 3,
      "materials": "a bit of fleece",
      "name": "Major Image",
      "range": "120 ft.",
      "requiresConcentration": true,
      "school": "Illusion",
      "tags": [
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "canCastAtHigherLevel": true,
      "castingTime": "1 Action",
      "components": [
        "V",
        "S"
      ],
      "description": "You attempt to beguile a humanoid that you can see within range. It must succeed on a Wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw.\n\nWhile the target is charmed, you have a telepathic link with it as long as the two of you are on the same plane of existence. You can use this telepathic link to issue commands to the creature while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as \"Attack that creature,\" \"Run over there,\" or \"Fetch that object.\" If the creature completes the order and doesn't receive further direction from you, it defends and preserves itself to the best of its ability.\n\nYou can use your action to take total and precise control of the target. Until the end of your next turn, the creature takes only the actions you choose, and doesn't do anything that you don't allow it to do. During this time you can also cause the creature to use a reaction, but this requires you to use your own reaction as well.\n\nEach time the target takes damage, it makes a new Wisdom saving throw against the spell. If the saving throw succeeds, the spell ends.\n\nAt Higher Levels. When you cast this spell using a 6th-level spell slot, the duration is concentration, up to 10 minutes. When you use a 7th-level spell slot, the duration is concentration, up to 1 hour. When you use a spell slot of 8th level or higher, the duration is concentration, up to 8 hours.",
      "duration": "Up to 1 minute",
      "higherLevelDescription": "When you cast this spell using a 6th-level spell slot, the duration is concentration, up to 10 minutes. When you use a 7th-level spell slot, the duration is concentration, up to 1 hour. When you use a spell slot of 8th level or higher, the duration is concentration, up to 8 hours.",
      "level": 5,
      "name": "Dominate Person",
      "range": "60 ft.",
      "requiresConcentration": true,
      "savingThrow": {
        "abilityName": "wis"
      },
      "school": "Enchantment",
      "tags": [
        "Bard",
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "castingTime": "1 Action",
      "components": [
        "V",
        "S",
        "M"
      ],
      "description": "You and up to eight willing creatures who link hands in a circle are transported to a different plane of existence. You can specify a target destination in general terms, such as the City of Brass on the Elemental Plane of Fire or the palace of Dispater on the second level of the Nine Hells, and you appear in or near that destination. If you are trying to reach the City of Brass, for example, you might arrive in its Street of Steel, before its Gate of Ashes, or looking at the city from across the Sea of Fire, at the DM's discretion.\n\nAlternatively, if you know the sigil sequence of a teleportation circle on another plane of existence, this spell can take you to that circle. If the teleportation circle is too small to hold all the creatures you transported, they appear in the closest unoccupied spaces next to the circle.\n\nYou can use this spell to banish an unwilling creature to another plane. Choose a creature within your reach and make a melee spell attack against it. On a hit, the creature must make a Charisma saving throw. If the creature fails this save, it is transported to a random location on the plane of existence you specify. A creature so transported must find its own way back to your current plane of existence.",
      "duration": "Instantaneous",
      "level": 7,
      "materials": "a forked, metal rod worth at least 250 gp, attuned to a particular plane of existence",
      "name": "Plane Shift",
      "range": "Touch",
      "rollsAttack": false,
      "savingThrow": {
      },
      "school": "Conjuration",
      "tags": [
        "Cleric",
        "Druid",
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "castingTime": "1 Action",
      "components": [
        "V",
        "S",
        "M"
      ],
      "description": "This spell gives the willing creature you touch the ability to see things as they actually are. For the duration, the creature has truesight, notices secret doors hidden by magic, and can see into the Ethereal Plane, all out to a range of 120 feet.",
      "duration": "1 hour",
      "level": 6,
      "materials": "an ointment for the eyes that costs 25 gp; is made from mushroom powder, saffron, and fat; and is consumed by the spell",
      "name": "True Seeing",
      "range": "Touch",
      "school": "Divination",
      "tags": [
        "Bard",
        "Cleric",
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    }
  ],
  "systemKey": "5e",
  "textBlocks": [
    {
      "title": "Class Features"
    },
    {
      "title": "Racial Traits"
    },
    {
      "title": "Feats"
    },
    {
      "textBlocks": [
        {
        },
        {
        }
      ],
      "title": "Background"
    },
    {
      "textBlocks": [
        {
          "title": "Personality Traits"
        },
        {
          "title": "Ideals"
        },
        {
          "title": "Bonds"
        },
        {
          "title": "Flaws"
        }
      ],
      "title": "Characteristics"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Appearance"
    },
    {
      "title": "Organizations"
    },
    {
      "title": "Allies"
    },
    {
      "title": "Enemies"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Backstory"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Other"
    },
    {
      "textBlocks": [
        {
          "body": "The rakshasa's innate spellcasting ability is Charisma (spell save DC 18, +10 to hit with spell attacks). The rakshasa can innately cast the following spells, requiring no material components:\n\nAt will: detect thoughts, disguise self, mage hand, minor illusion\n\n3/day each: charm person, detect magic, invisibility, major image, suggestion\n\n1/day each: dominate person, fly, plane shift, true seeing",
          "title": "Innate Spellcasting"
        },
        {
          "body": "The rakshasa can't be affected or detected by spells of 6th level or lower unless it wishes to be. It has advantage on saving throws against all other spells and magical effects.",
          "title": "Limited Magic Immunity"
        },
        {
          "body": "The rakshasa makes two claw attacks.",
          "title": "Multiattack"
        }
      ],
      "title": "Abilities"
    }
  ],
  "trackers": [
    {
      "color": "Yellow",
      "max": 355000,
      "name": "XP",
      "type": "Bar",
      "value": 10000
    },
    {
      "color": "Green",
      "max": 110,
      "name": "HP",
      "type": "Bar",
      "value": 110
    }
  ],
  "type": "Fiend"
}