{
  "abilityScores": [
    {
      "name": "str",
      "value": 18
    },
    {
      "name": "dex",
      "value": 18
    },
    {
      "name": "con",
      "value": 18
    },
    {
      "name": "int",
      "value": 17
    },
    {
      "name": "wis",
      "value": 15
    },
    {
      "name": "cha",
      "value": 18
    }
  ],
  "actions": [
    {
      "description": "Melee Weapon Attack: +9 to hit, reach 5 ft., one creature. Hit: 8 (1d8 + 4) bludgeoning damage. Instead of dealing damage, the vampire can grapple the target (escape DC 18).",
      "name": "Unarmed Strike (Vampire Form Only)",
      "sortOrder": 0,
      "steps": [
        {
          "attack": {
            "ability": "dex",
            "crit": 20,
            "damageRolls": [
              {
                "abilityName": "dex",
                "dice": "1d8",
                "type": "Bludgeoning"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Unarmed Strike (Vampire Form Only)",
            "rollsAttack": true,
            "savingThrow": {
            }
          },
          "journalCommand": {
          },
          "skillCheck": {
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "Melee Weapon Attack: +9 to hit, reach 5 ft., one willing creature, or a creature that is grappled by the vampire, incapacitated, or restrained. Hit: 7 (1d6 + 4) piercing damage plus 10 (3d6) necrotic damage. The target's hit point maximum is reduced by an amount equal to the necrotic damage taken, and the vampire regains hit points equal to that amount. The reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hit point maximum to 0. A humanoid slain in this way and then buried in the ground rises the following night as a vampire spawn under the vampire's control.",
      "name": "Bite (Bat or Vampire Form Only)",
      "sortOrder": 1,
      "steps": [
        {
          "attack": {
            "ability": "str",
            "crit": 20,
            "damageRolls": [
              {
                "abilityName": "str",
                "dice": "1d6",
                "type": "Piercing"
              },
              {
                "dice": "3d6",
                "type": "Necrotic"
              }
            ],
            "isProficient": true,
            "isRanged": false,
            "name": "Bite (Bat or Vampire Form Only)",
            "rollsAttack": true,
            "savingThrow": {
            }
          },
          "journalCommand": {
          },
          "skillCheck": {
          },
          "type": "custom-attack"
        }
      ]
    },
    {
      "description": "The vampire targets one humanoid it can see within 30 feet of it. If the target can see the vampire, the target must succeed on a DC 17 Wisdom saving throw against this magic or be charmed by the vampire. The charmed target regards the vampire as a trusted friend to be heeded and protected. Although the target isn't under the vampire's control, it takes the vampire's requests or actions in the most favorable way it can, and it is a willing target for the vampire's bite attack.\n   Each time the vampire or the vampire's companions do anything harmful to the target, it can repeat the saving throw, ending the effect on itself on a success. Otherwise, the effect lasts 24 hours or until the vampire is destroyed, is on a different plane of existence than the target, or takes a bonus action to end the effect.",
      "name": "Charm",
      "sortOrder": 2,
      "steps": [
        {
          "attack": {
            "crit": 20,
            "isProficient": true,
            "isRanged": false,
            "name": "Charm",
            "rollsAttack": false,
            "savingThrow": {
              "abilityName": "wis",
              "difficultyClass": 17
            }
          },
          "journalCommand": {
          },
          "skillCheck": {
          },
          "type": "custom-attack"
        }
      ]
    }
  ],
  "alignment": "Lawful Evil",
  "armorClass": 16,
  "armorType": "Natural Armor",
  "challengeRating": "13",
  "classes": [
    {
      "class": "Monster",
      "level": 1
    }
  ],
  "currentHp": 144,
  "damageResistances": [
    {
      "damageType": "Necrotic"
    },
    {
      "condition": "Nonmagical",
      "damageType": "Bludgeoning"
    },
    {
      "condition": "Nonmagical",
      "damageType": "Piercing"
    },
    {
      "condition": "Nonmagical",
      "damageType": "Slashing"
    }
  ],
  "exp": 10000,
  "hitDice": "17d8+68",
  "imageUri": "https://cdn.alchemyrpg.com/app-assets/undead-token.svg",
  "initiativeBonus": 0,
  "isNPC": true,
  "maxHp": 144,
  "movementModes": [
    {
      "distance": 30,
      "mode": "Walking"
    }
  ],
  "name": "Vampire",
  "proficiencies": [
    {
      "name": "Dexterity",
      "type": "save"
    },
    {
      "name": "Wisdom",
      "type": "save"
    },
    {
      "name": "Charisma",
      "type": "save"
    },
    {
      "name": "the languages it knew in life",
      "type": "language"
    }
  ],
  "proficiencyBonus": 5,
  "race": "NPC",
  "senses": [
    {
      "distance": 120,
      "name": "Darkvision"
    }
  ],
  "size": "Medium",
  "skills": [
    {
      "abilityName": "dex",
      "name": "Acrobatics",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Animal Handling",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Arcana",
      "proficient": false
    },
    {
      "abilityName": "str",
      "name": "Athletics",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Deception",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "History",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Insight",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Intimidation",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Investigation",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Medicine",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Nature",
      "proficient": false
    },
    {
      "abilityName": "wis",
      "name": "Perception",
      "proficient": true
    },
    {
      "abilityName": "cha",
      "name": "Performance",
      "proficient": false
    },
    {
      "abilityName": "cha",
      "name": "Persuasion",
      "proficient": false
    },
    {
      "abilityName": "int",
      "name": "Religion",
      "proficient": false
    },
    {
      "abilityName": "dex",
      "name": "Sleight of Hand",
      "proficient": false
    },
    {
      "abilityName": "dex",
      "name": "Stealth",
      "proficient": true
    },
    {
      "abilityName": "wis",
      "name": "Survival",
      "proficient": false
    }
  ],
  "speed": 30,
  "textBlocks": [
    {
      "title": "Class Features"
    },
    {
      "title": "Racial Traits"
    },
    {
      "title": "Feats"
    },
    {
      "textBlocks": [
        {
        },
        {
        }
      ],
      "title": "Background"
    },
    {
      "textBlocks": [
        {
          "title": "Personality Traits"
        },
        {
          "title": "Ideals"
        },
        {
          "title": "Bonds"
        },
        {
          "title": "Flaws"
        }
      ],
      "title": "Characteristics"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Appearance"
    },
    {
      "title": "Organizations"
    },
    {
      "title": "Allies"
    },
    {
      "title": "Enemies"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Backstory"
    },
    {
      "textBlocks": [
        {
        }
      ],
      "title": "Other"
    },
    {
      "textBlocks": [
        {
          "body": "If the vampire isn't in sunlight or running water, it can use its action to polymorph into a Tiny bat or a Medium cloud of mist, or back into its true form.\n   While in bat form, the vampire can't speak, its walking speed is 5 feet, and it has a flying speed of 30 feet. Its statistics, other than its size and speed, are unchanged. Anything it is wearing transforms with it, but nothing it is carrying does. It reverts to its true form if it dies.\n   While in mist form, the vampire can't take any actions, speak, or manipulate objects. It is weightless, has a flying speed of 20 feet, can hover, and can enter a hostile creature's space and stop there. In addition, if air can pass through a space, the mist can do so without squeezing, and it can't pass through water. It has advantage on Strength, Dexterity, and Constitution saving throws, and it is immune to all nonmagical damage, except the damage it takes from sunlight.",
          "title": "Shapechanger"
        },
        {
          "body": "If the vampire fails a saving throw, it can choose to succeed instead.",
          "title": "Legendary Resistance (3/Day)"
        },
        {
          "body": "When it drops to 0 hit points outside its resting place, the vampire transforms into a cloud of mist (as in the Shapechanger trait) instead of falling unconscious, provided that it isn't in sunlight or running water. If it can't transform, it is destroyed.\n   While it has 0 hit points in mist form, it can't revert to its vampire form, and it must reach its resting place within 2 hours or be destroyed. Once in its resting place, it reverts to its vampire form. It is then paralyzed until it regains at least 1 hit point. After spending 1 hour in its resting place with 0 hit points, it regains 1 hit point.",
          "title": "Misty Escape"
        },
        {
          "body": "The vampire regains 20 hit points at the start of its turn if it has at least 1 hit point and isn't in sunlight or running water. If the vampire takes radiant damage or damage from holy water, this trait doesn't function at the start of the vampire's next turn.",
          "title": "Regeneration"
        },
        {
          "body": "The vampire can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check.",
          "title": "Spider Climb"
        },
        {
          "body": "The vampire has the following flaws:\n\nForbiddance. The vampire can't enter a residence without an invitation from one of the occupants.\n\nHarmed by Running Water. The vampire takes 20 acid damage if it ends its turn in running water.\n\nStake to the Heart. If a piercing weapon made of wood is driven into the vampire's heart while the vampire is incapacitated in its resting place, the vampire is paralyzed until the stake is removed.\n\nSunlight Hypersensitivity. The vampire takes 20 radiant damage when it starts its turn in sunlight. While in sunlight, it has disadvantage on attack rolls and ability checks.",
          "title": "Vampire Weaknesses"
        },
        {
          "body": "The vampire makes two attacks, only one of which can be a bite attack.",
          "title": "Multiattack (Vampire Form Only)"
        },
        {
          "body": "The vampire can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The vampire regains spent legendary actions at the start of its turn.\n\nMove. The vampire moves up to its speed without provoking opportunity attacks.\n\nUnarmed Strike. The vampire makes one unarmed strike.\n\nBite (Costs 2 Actions). The vampire makes one bite attack.",
          "title": "Legendary Actions"
        },
        {
          "body": "The region surrounding a vampire's lair is warped by the creature's unnatural presence, creating any of the following effects:\n\n* There's a noticeable increase in the populations of bats, rats, and wolves in the region.\n\n* Plants within 500 feet of the lair wither, and their stems and branches become twisted and thorny.\n\n* Shadows cast within 500 feet of the lair seem abnormally gaunt and sometimes move as though alive.\n\n* A creeping fog clings to the ground within 500 feet of the vampire's lair. The fog occasionally takes eerie forms, such as grasping claws and writhing serpents.\n\nIf the vampire is destroyed, these effects end after 2d6 days.",
          "title": "Regional Effects"
        },
        {
          "body": "The vampire magically calls 2d4 swarms of bats or rats, provided that the sun isn't up. While outdoors, the vampire can call 3d6 wolves instead. The called creatures arrive in 1d4 rounds, acting as allies of the vampire and obeying its spoken commands. The beasts remain for 1 hour, until the vampire dies, or until the vampire dismisses them as a bonus action.",
          "title": "Children of the Night (1/Day)"
        }
      ],
      "title": "Abilities"
    }
  ],
  "type": "Undead",
  "typeTags": [
    "Shapechanger"
  ]
}